javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
/*
 * ESP32 MMDVM Hotspot
 *
 * A professional ESP32-based DMR hotspot with MMDVM modem support, real-time web interface,
 * and BrandMeister network integration. Full duplex operation with Network → RF and RF → Network paths.
 *
 * Hardware Requirements:
 * - ESP32-S3 Development Board (LILYGO T-ETH-Elite recommended) or ESP32-WROOM-32/WROVER
 * - MMDVM HS Hat (14.7456MHz ADF7021, confirmed working)
 * - Antenna and appropriate radio frontend (UHF/VHF)
 * - Optional: OLED Display (SSD1306 128x64 I2C)
 * - Optional: RGB LED (GPIO 40/41/42)
 *
 * Pin Connections (LILYGO T-ETH-Elite ESP32-S3):
 * MMDVM Serial:
 * - MMDVM RX <- ESP32 GPIO 43 (TX to MMDVM)
 * - MMDVM TX -> ESP32 GPIO 44 (RX from MMDVM)
 * - MMDVM WAKEUP <- ESP32 GPIO 13 (keeps modem active)
 * - MMDVM BOOT0 <- ESP32 GPIO 4 (bootloader control for firmware flashing)
 * - MMDVM COS/LED <- ESP32 GPIO 38 (carrier detect LED)
 * - Baud Rate: 115200 (SERIAL_8N1)
 *
 * OLED Display (I2C, optional):
 * - SDA -> ESP32 GPIO 17
 * - SCL -> ESP32 GPIO 18
 * - I2C Address: 0x3C or 0x3D
 *
 * RGB LED (optional):
 * - Red -> ESP32 GPIO 41
 * - Green -> ESP32 GPIO 40
 * - Blue -> ESP32 GPIO 42
 *
 * Button:
 * - OLED Toggle -> ESP32 GPIO 0
 *
 * Libraries needed (ESP32 Arduino Core):
 * Built-in ESP32 Libraries:
 * - WiFi (WiFi network connectivity)
 * - WiFiUdp (UDP communication for DMR network)
 * - WebServer (Professional web interface)
 * - ESPmDNS (Network discovery - esp32-mmdvm.local)
 * - Preferences (Configuration storage with NVS)
 * - HTTPClient (OTA firmware downloads from GitHub)
 * - Update (OTA firmware flashing)
 * - WiFiClientSecure (Secure HTTPS connections)
 * - mbedtls/md.h (SHA256 cryptographic authentication)
 * - nvs_flash (NVS partition management for factory reset)
 * - time.h (NTP time synchronization)
 * - PubSubClient (MQTT publishing for home automation)
 * - Wire (I2C communication for OLED)
 * - ETH/ETHClass2 (Ethernet support for T-ETH-Elite)
 * - SPI (SD card support for T-ETH-Elite)
 * - SD (SD card file system)
 *
 * External Libraries (install via Arduino Library Manager):
 * - Adafruit GFX Library (for OLED display graphics)
 * - Adafruit SSD1306 (for OLED display driver)
 *
 * Features:
 * - Full duplex DMR operation (Network → RF and RF → Network)
 * - BrandMeister network integration with SHA256 authentication
 * - Real-time web interface with REST API (20+ endpoints)
 * - MQTT publishing for home automation (Home Assistant, Node-RED, Grafana)
 * - MMDVM firmware flasher (online from GitHub or file upload)
 * - Multi-network WiFi with auto-failover (primary + 5 backup slots)
 * - OLED display with auto-blank and bootlogo
 * - RGB LED status indicators
 * - Configuration management (import/export, backup/restore)
 * - OTA ESP32 firmware updates
 * - Dual history tracking (network RX and local RF TX)
 * - User lookup with dual-cache system (RadioID.net API)
 *
 * Developed by PD2EMC & PD8JO
 * Repository: https://github.com/javastraat/esp32_mmdvm_hotspot
 * License: Amateur Radio Non-Commercial License
 * For licensed amateur radio operators only
 */

#include <WiFi.h>
#include <WiFiUdp.h>
#include <WebServer.h>
#include <ESPmDNS.h>
#include <Preferences.h>
#include "mbedtls/md.h"
#include "nvs_flash.h"
#include <Update.h>
#include <HTTPClient.h>
#include <time.h>
#include <PubSubClient.h>
#include "include/config.h"
#include "include/webpages.h"
#include "include/RGBLedController.h"
#include "include/modem_flasher.h"

// DMR Decoder Library
#include "include/dmr/DMRLC.cpp"
#include "include/dmr/DMRBPTC.cpp"
#include "include/dmr/DMRRS.cpp"
#include "include/dmr/DMRFullLC.cpp"
#include "include/dmr/DMRDecoder.cpp"

// OLED Display Support (runtime enable/disable)
#include <Wire.h>
#include <Adafruit_GFX.h>
#include <Adafruit_SSD1306.h>
//#include <sqlite3.h>

#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
#include <sqlite3.h>
#if ESP_ARDUINO_VERSION < ESP_ARDUINO_VERSION_VAL(3, 0, 0)
#include <ETHClass2.h>  //Is to use the modified ETHClass
#define ETH ETH2
#else
#include <ETH.h>
#endif
static bool eth_connected = false;
#include <SPI.h>
#include <SD.h>
#endif  // LILYGO_T_ETH_ELITE_ESP32S3_MMDVM

// SD Card pins are defined in config.h
SPIClass sdSPI(HSPI);  // Use HSPI for SD card
bool sdCardAvailable = false;
uint8_t sdCardType = 0;  // Cached SD card type

// ESP32-S3 USB Serial configuration
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
#if ARDUINO_USB_MODE
#warning "USB MODE is enabled - Serial will work via USB CDC"
#endif
#if ARDUINO_USB_CDC_ON_BOOT
#warning "USB CDC ON BOOT is enabled"
#endif
#endif

// ===== Configuration from config.h =====
// WiFi Settings
const char* ssid = WIFI_SSID;
const char* password = WIFI_PASSWORD;

// Fallback AP mode settings (from config.h)
const char* ap_ssid = AP_SSID;
const char* ap_password = AP_PASSWORD;

// DMR Network Settings (can be overridden by stored config)
String dmr_callsign = DMR_CALLSIGN;
uint32_t dmr_id = DMR_ID;
String dmr_server = DMR_SERVER;
String dmr_password = DMR_PASSWORD;
uint8_t dmr_essid = 0;  // ESSID 0-99
const int dmr_port = DMR_PORT;

// Additional DMR Configuration
uint32_t dmr_rx_freq = 434000000;  // RX Frequency in Hz
uint32_t dmr_tx_freq = 434000000;  // TX Frequency in Hz
uint8_t dmr_power = 10;            // Power 0-99
uint8_t dmr_color_code = 1;        // Color Code 0-15
float dmr_latitude = 0.0;          // Latitude
float dmr_longitude = 0.0;         // Longitude
int dmr_height = 0;                // Height in meters
String dmr_location = DMR_LOCATION;
String dmr_description = DMR_DESCRIPTION;
String dmr_url = DMR_URL;

// Hostname setting
String device_hostname = MDNS_HOSTNAME;

// NTP Time settings
long ntp_timezone_offset = NTP_TIMEZONE_OFFSET;  // Timezone offset in seconds
long ntp_daylight_offset = NTP_DAYLIGHT_OFFSET;  // Daylight saving offset in seconds

// Verbose logging setting (shows keepalive messages)
bool verbose_logging = false;

// Debug settings (from config.h or preferences)
bool debug_serial = DEBUG_SERIAL;
bool debug_mmdvm = DEBUG_MMDVM;
bool debug_network = DEBUG_NETWORK;
bool debug_dmr = DEBUG_DMR;
bool debug_password = DEBUG_PASSWORD;

// OLED display setting (from config.h or preferences)
bool enable_oled = ENABLE_OLED;

