javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
// WiFi icon (8x8)
static const unsigned char PROGMEM icon_wifi[] = {
  0b00000000,
  0b00111100,
  0b01000010,
  0b10011001,
  0b00100100,
  0b00011000,
  0b00011000,
  0b00000000
};

// Ethernet/Cable icon (8x8)
static const unsigned char PROGMEM icon_ethernet[] = {
  0b00000000,
  0b01111110,
  0b01000010,
  0b01011010,
  0b01011010,
  0b01000010,
  0b01111110,
  0b00000000
};

// Antenna/RF icon (8x8) - looks like radio waves
static const unsigned char PROGMEM icon_antenna[] = {
  0b00011000,
  0b00111100,
  0b01011010,
  0b10011001,
  0b00011000,
  0b00100100,
  0b01000010,
  0b10000001
};

// DMR icon (8x8)
static const unsigned char PROGMEM icon_dmr[] = {
  0b11111111,
  0b11000011,
  0b10100101,
  0b10011001,
  0b10011001,
  0b10100101,
  0b11000011,
  0b11111111
};

#endif

// Serial Monitor Buffer (SERIAL_LOG_SIZE defined in webpages.h)
String serialLog[SERIAL_LOG_SIZE];
int serialLogIndex = 0;

unsigned long lastKeepalive = 0;

// DMR Activity Tracking (struct defined in home.h)
// Track up to 2 simultaneous transmissions (one per slot)
DMRActivity dmrActivity[2] = {
  { 0, 0, 1, true, "", "", "", "", "", 0, 0, false },
  { 0, 0, 2, true, "", "", "", "", "", 0, 0, false }
};

// DMR Transmission Tracking (for consolidated log output)
struct DMRTransmission {
  uint32_t srcId;
  uint32_t dstId;
  uint8_t slotNo;
  bool isGroup;
  uint8_t startSeq;
  uint8_t lastSeq;
  bool active;
  String frameType;
};
DMRTransmission currentTx[2] = { { 0, 0, 0, true, 0, 0, false, "" }, { 0, 0, 0, true, 0, 0, false, "" } };

// TX Sequence and Stream ID tracking (for building DMRD packets when transmitting)
uint8_t txSequence = 0;        // Incrementing sequence number for TX packets
uint32_t txStreamId = 0;       // Stream ID for current TX transmission
unsigned long lastTxTime = 0;  // Timestamp of last TX packet (to detect new transmissions)

// RF Transmission tracking (for local TX history)
struct RFTransmission {
  bool active;
  uint32_t srcId;
  uint32_t dstId;
  uint8_t slotNo;
  bool isGroup;
  unsigned long startTime;
  String srcCallsign;
  uint8_t startSeq;  // First sequence number
  uint8_t lastSeq;   // Last sequence number
};
RFTransmission currentRFTx[2] = { { false, 0, 0, 1, true, 0, "", 0, 0 }, { false, 0, 0, 2, true, 0, "", 0, 0 } };  // One per slot

// DMR Transmission History (for Recent Activity display - INCOMING from network)
// struct DMRHistory is defined in webpages.h/home.h
DMRHistory dmrHistory[DMR_HISTORY_SIZE];
int dmrHistoryIndex = 0;
void addDMRHistory(uint32_t srcId, String srcCallsign, String srcName, String srcLocation, uint32_t dstId, bool isGroup, uint32_t duration, uint8_t ber, uint8_t rssi, uint8_t slotNo);

// Local RF Activity History (for Local RF Activity display - OUTGOING to network)
// struct RFActivityHistory is defined in webpages.h/home.h
#define RF_HISTORY_SIZE 15
RFActivityHistory rfHistory[RF_HISTORY_SIZE];
int rfHistoryIndex = 0;
void addRFHistory(uint32_t srcId, String srcCallsign, uint32_t dstId, bool isGroup, uint32_t duration, uint8_t slotNo);

// DMR User Information Lookup Cache
struct UserInfoCache {
  uint32_t dmrId;
  String callsign;
  String userInfo;  // Format: "callsign|name|city|country"
  unsigned long timestamp;
};
UserInfoCache userCache[DMR_USER_CACHE_SIZE];
int userCacheIndex = 0;

// Legacy callsign cache for backward compatibility
struct CallsignCache {
  uint32_t dmrId;
  String callsign;
  unsigned long timestamp;
};
CallsignCache callsignCache[DMR_CALLSIGN_CACHE_SIZE];
int callsignCacheIndex = 0;

// Store alternate WiFi credentials
// Alternate WiFi Networks (up to 5) - labels from config.h
WiFiNetwork wifiNetworks[5] = {
  { WIFI_SLOT1_LABEL, "", "" },
  { WIFI_SLOT2_LABEL, "", "" },
  { WIFI_SLOT3_LABEL, "", "" },
  { WIFI_SLOT4_LABEL, "", "" },
  { WIFI_SLOT5_LABEL, "", "" }
};

// Firmware version from config.h
String firmwareVersion = FIRMWARE_VERSION;
String modemFirmwareVersion = "Unknown";  // MMDVM modem firmware version

// LED Status Control (STATUS_LED_PIN defined in config.h)

enum class LED_MODE {
  OFF,
  STEADY,      // Connected to WiFi
  FAST_BLINK,  // Connecting to WiFi
  SLOW_BLINK   // Access Point mode
};
LED_MODE currentLedMode = LED_MODE::OFF;
unsigned long lastLedToggle = 0;
bool ledState = false;

// Mode Enable/Disable Settings (defaults from config.h)
bool mode_dmr_enabled = DEFAULT_MODE_DMR;
bool mode_dstar_enabled = DEFAULT_MODE_DSTAR;
bool mode_ysf_enabled = DEFAULT_MODE_YSF;
bool mode_p25_enabled = DEFAULT_MODE_P25;
bool mode_nxdn_enabled = DEFAULT_MODE_NXDN;
bool mode_pocsag_enabled = DEFAULT_MODE_POCSAG;

// Modem Type Selection
String modem_type = DEFAULT_MODEM_TYPE;

// OLED timing and state variables (always available for runtime checks)
unsigned long lastOLEDUpdate = 0;
unsigned long lastNetworkToggle = 0;      // Separate timer for network toggle
#define OLED_UPDATE_INTERVAL 5000         // Update OLED every 5 seconds (idle)
#define OLED_UPDATE_INTERVAL_ACTIVE 1000  // Update OLED every 2 seconds when DMR active (reduced from 1s to avoid SPI conflicts)
#define NETWORK_TOGGLE_INTERVAL 5000      // Toggle network display every 5 seconds
bool oledShowEthernet = true;             // Toggle between ETH and WiFi display when both connected
int oledActiveSlot = 1;                   // Track which slot to display when both active (start with Slot 2)
int oledHeaderCycle = 0;                  // Cycle through: 0=WiFi, 1=ETH, 2=Callsign (or fewer if not all connected)
bool oledDisplayOn = true;                // Track OLED display power state (for physical on/off control)

// OLED Auto-Blanking variables
bool oledAutoBlankEnabled = OLED_AUTO_BLANK_ENABLE;   // Enable/disable auto-blanking (can be changed at runtime)
unsigned long oledBlankTimeout = OLED_BLANK_TIMEOUT;  // Timeout duration in milliseconds (can be changed at runtime)
unsigned long lastActivityTime = 0;                   // Timestamp of last activity (DMR, button press, etc.)
bool oledBlankingActive = false;                      // Track if screen was auto-blanked (vs manually turned off)

// ===== Function Prototypes =====
void setupWiFi();
void setupAccessPoint();
void setupEthernet();
void WiFiEvent(arduino_event_id_t event);
void setupWebServer();
void setupMMDVM();
void setupOLED();
void displayESP32Logo();
void testdrawbitmap();
void displayBootLogo();
void updateBootStatus(String status);
void updateOLEDStatus();
void setOLEDPower(bool on);
void toggleOLEDPower();
void loadConfig();
void saveConfig();
void handleMMDVMSerial();
void handleNetwork();
void mqttPublishSystemInfo();
void mqttPublishHardwareModem();
void mqttPublishNetworkWifi();
void mqttPublishNetworkDMR();
void mqttPublishMMDVMConfig();
void mqttPublishStationInfo();
void mqttPublishSlotActivity(int slot, uint32_t srcId, uint32_t dstId, const String& callsign,
                              const String& name, const String& city, const String& country, bool isGroup,
                              bool active, uint32_t duration);
void sendMMDVMCommand(uint8_t cmd, uint8_t* data, uint16_t length);
void writeDMRStart(bool tx, String callsign = "");
void sendFrequency(uint32_t rxFreq, uint32_t txFreq, uint8_t rfPower);
void processMMDVMFrame();
void updateStatusLED();
void setLEDMode(LED_MODE mode);
void sendDMRKeepalive();
void connectToDMRNetwork();
void sendDMRAuth();
void sendDMRConfig();
void logSerial(String message);
void logSerialVerbose(String message);
String lookupCallsign(uint32_t dmrId);
String lookupCallsignAPI(uint32_t dmrId);
String lookupUserInfo(uint32_t dmrId);
String lookupUserInfoAPI(uint32_t dmrId);
String getCachedCallsign(uint32_t dmrId);
String getCachedUserInfo(uint32_t dmrId);
void cacheCallsign(uint32_t dmrId, String callsign);
void cacheUserInfo(uint32_t dmrId, String userInfo);
void addDMRHistory(uint32_t srcId, String srcCallsign, String srcName, String srcLocation, uint32_t dstId, bool isGroup, uint32_t duration, uint8_t ber, uint8_t rssi, uint8_t slotNo);

#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
// Helper functions for status page
String getEthIPAddress();
String getEthMACAddress();
int getEthLinkSpeed();
bool getEthFullDuplex();
String getEthGatewayIP();
uint64_t getSDCardSize();
uint64_t getSDUsedBytes();
uint8_t getSDCardType();
#endif

// Web handlers are defined in webpages.h

void setup() {
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
  // ESP32-S3 USB CDC (native USB support)
  Serial.begin(115200);
  delay(1000);
  // Wait for USB Serial to be ready (ESP32-S3 native USB)
  while (!Serial && millis() < 3000) {
    delay(10);
  }
#else
  Serial.begin(115200);
  delay(1000);
#endif

  logSerial("\n\n=== ESP32 MMDVM Hotspot by PD2EMC & PD8JO ===");
  logSerial("[SYSTEM] Initializing...");

  // Load OLED preference early (before setupOLED)
  preferences.begin("mmdvm", false);
  enable_oled = preferences.getBool("enable_oled", ENABLE_OLED);
  preferences.end();

  // Initialize OLED Display early (before other components)
  if (enable_oled) {
    setupOLED();
    updateBootStatus("Loading config...");
  }

  // Load full configuration
  loadConfig();

