javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  // Configure MQTT buffer size (default is 256 bytes, increase for larger payloads)
  mqttClient.setBufferSize(1024);  // 1KB buffer for system info and modem status messages

  // Setup GPIO
  pinMode(OLED_BUTTON_PIN, INPUT_PULLUP);  // Button to toggle OLED display on/off
  pinMode(COS_LED_PIN, OUTPUT);
  pinMode(STATUS_LED_PIN, OUTPUT);  // Setup status LED
  digitalWrite(COS_LED_PIN, LOW);
  digitalWrite(STATUS_LED_PIN, LOW);

  // Initialize RGB LED Status Indicator
#if ENABLE_RGB_LED
  rgbLed.begin();
  rgbLed.setStatus(RGBLedStatus::DISCONNECTED);
  logSerial("[RGB LED] RGB LED initialized");
#endif

  // Setup MMDVM Serial
  if (enable_oled) {
    updateBootStatus("Init MMDVM...");
  }
  MMDVM_SERIAL.begin(SERIAL_BAUD, SERIAL_8N1, RX_PIN, TX_PIN);
  logSerial("[MODEM] MMDVM Serial initialized");

  // Initialize SD Card
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
  if (enable_oled) {
    updateBootStatus("Init SD Card...");
  }
  logSerial("[SD] Initializing SD card...");
  sdSPI.begin(SD_SCLK_PIN, SD_MISO_PIN, SD_MOSI_PIN, SD_CS_PIN);

  if (SD.begin(SD_CS_PIN, sdSPI)) {
    sdCardAvailable = true;
    sdCardType = SD.cardType();  // Cache the card type
    uint64_t cardSize = SD.cardSize() / (1024 * 1024);
    logSerial("[SD] SD Card initialized successfully");
    logSerial("[SD] SD Card Size: " + String((uint32_t)cardSize) + " MB");
    logSerial("[SD] SD Card Type: " + String(sdCardType == CARD_MMC ? "MMC" : sdCardType == CARD_SD   ? "SD"
                                                                            : sdCardType == CARD_SDHC ? "SDHC"
                                                                                                      : "Unknown"));

    // Create directories if they don't exist
    if (!SD.exists("/logs")) {
      SD.mkdir("/logs");
      logSerial("[SD] Created /logs directory");
    }
    if (!SD.exists("/config")) {
      SD.mkdir("/config");
      logSerial("[SD] Created /config directory");
    }
    if (!SD.exists("/cache")) {
      SD.mkdir("/cache");
      logSerial("[SD] Created /cache directory");
    }

    // Test: Read owner.txt if it exists
    if (SD.exists("/owner.txt")) {
      logSerial("[SD] Found /owner.txt on SD card, reading contents:");
      File testFile = SD.open("/owner.txt");
      if (testFile) {
        logSerial("[SD] --- Start of owner.txt ---");
        while (testFile.available()) {
          Serial.write(testFile.read());
        }
        testFile.close();
        logSerial("[SD] \n--- End of owner.txt ---");
      } else {
        logSerial("[SD] Error: Could not open owner.txt");
      }
    } else {
      logSerial("[SD] No owner.txt file found on SD card");
    }
  } else {
    sdCardAvailable = false;
    logSerial("[SD] SD Card initialization failed (card not present or error)");
    logSerial("[SD] Continuing without SD card support...");
  }
#endif

  // Setup Network (Ethernet with WiFi fallback, or WiFi only)
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
  if (enable_oled) {
    updateBootStatus("Init Ethernet...");
  }
  setupEthernet();

  // Wait up to 10 seconds for Ethernet to connect
  logSerial("[ETH] Waiting for Ethernet connection...");
  int eth_attempts = 0;
  while (!eth_connected && eth_attempts < 20) {
    delay(500);
    Serial.print(".");
    eth_attempts++;
  }

  if (eth_connected) {
    logSerial("[ETH] \nEthernet connected successfully!");
    logSerial("[ETH] IP address: " + ETH.localIP().toString());
  } else {
    // Ethernet failed, try WiFi (Ethernet will keep trying in background)
    logSerial("[ETH] \nEthernet connection timeout. Falling back to WiFi...");
    logSerial("[ETH] Note: Ethernet will continue trying in background.");
    if (enable_oled) {
      updateBootStatus("Connecting WiFi...");
    }
    setupWiFi();
  }
#else
  if (enable_oled) {
    updateBootStatus("Connecting WiFi...");
  }
  setupWiFi();
#endif

// Setup Web Server
//setupWebServer();
#if ENABLE_WEBSERVER
  if (enable_oled) {
    updateBootStatus("Starting web...");
  }
  setupWebServer();
#endif

// Start mDNS
// if (MDNS.begin(device_hostname.c_str())) {
//   logSerial("mDNS started: http://" + device_hostname + ".local");
// }
#if ENABLE_MDNS
  if (MDNS.begin(device_hostname.c_str())) {
    logSerial("[SYSTEM] mDNS started: http://" + device_hostname + ".local");
  }
#endif

  // Initialize NTP Time
  // Check if we have any network connection
  bool hasNetwork = wifiConnected;
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
  hasNetwork = hasNetwork || eth_connected;
#endif

  if (hasNetwork) {
    if (enable_oled) {
      updateBootStatus("Syncing time...");
    }
    logSerial("[NTP] Initializing NTP time client...");
    // Configure time with NTP servers (using saved timezone settings or config.h defaults)
    configTime(ntp_timezone_offset, ntp_daylight_offset, NTP_SERVER1, NTP_SERVER2);

    // Wait a bit for time sync
    int ntp_attempts = 0;
    struct tm timeinfo;
    while (!getLocalTime(&timeinfo) && ntp_attempts < 10) {
      delay(500);
      ntp_attempts++;
    }

    if (ntp_attempts < 10) {
      logSerial("[NTP] NTP time synchronized successfully");
      char timeStr[64];
      strftime(timeStr, sizeof(timeStr), "%Y-%m-%d %H:%M:%S", &timeinfo);
      logSerial("[NTP] Current time: " + String(timeStr));
    } else {
      logSerial("[NTP] Warning: NTP time sync failed, timestamps will use system time");
    }
  }

  // Initialize MMDVM
  setupMMDVM();

  // Connect to Networks (based on enabled modes)
  if (wifiConnected) {
    // DMR Network Connection
    if (mode_dmr_enabled) {
#if ENABLE_OLED
      updateBootStatus("Connecting DMR...");
#endif
      connectToDMRNetwork();
    } else {
      logSerial("[MODE] DMR mode is disabled - skipping DMR network connection");
    }

    // D-Star Network Connection (not implemented yet)
    if (mode_dstar_enabled) {
      logSerial("[MODE] D-Star mode is enabled but network connection not implemented yet");
    } else {
      logSerial("[MODE] D-Star mode is disabled by default (not implemented yet)");
    }

    // YSF Network Connection (not implemented yet)
    if (mode_ysf_enabled) {
      logSerial("[MODE] YSF mode is enabled but network connection not implemented yet");
    } else {
      logSerial("[MODE] YSF mode is disabled by default (not implemented yet)");
    }

    // P25 Network Connection (not implemented yet)
    if (mode_p25_enabled) {
      logSerial("[MODE] P25 mode is enabled but network connection not implemented yet");
    } else {
      logSerial("[MODE] P25 mode is disabled by default (not implemented yet)");
    }

