javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
    // NXDN Network Connection (not implemented yet)
    if (mode_nxdn_enabled) {
      logSerial("[MODE] NXDN mode is enabled but network connection not implemented yet");
    } else {
      logSerial("[MODE] NXDN mode is disabled by default (not implemented yet)");
    }

    // POCSAG Network Connection (not implemented yet)
    if (mode_pocsag_enabled) {
      logSerial("[MODE] POCSAG mode is enabled but network connection not implemented yet");
    } else {
      logSerial("[MODE] POCSAG mode is disabled by default (not implemented yet)");
    }
  } else {
    logSerial("[SYSTEM] WiFi not connected - skipping all network connections");
  }

  if (enable_oled) {
    updateBootStatus("Ready!");
  }
  delay(1000);  // Show "Ready!" for 1 second

  logSerial("[SYSTEM] Setup complete!");
  if (apMode) {
    logSerial("[AP] Access Point Mode - Connect to: " + String(ap_ssid));
    logSerial("[AP] Web Interface: http://192.168.4.1");
  } else if (wifiConnected) {
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
    if (eth_connected) {
      logSerial("[ETH] Web Interface: http://" + ETH.localIP().toString());
    } else {
      logSerial("[WiFi] Web Interface: http://" + WiFi.localIP().toString());
    }
#else
    logSerial("[WiFi] Web Interface: http://" + WiFi.localIP().toString());
#endif
  }

  // Update OLED with network status after setup is complete
  if (enable_oled) {
    updateOLEDStatus();
  }

  // Initialize auto-blanking timer
  lastActivityTime = millis();
}

void loop() {
  // MMDVM wakeup serial on GPIO 13 stays open (no need to send more data after initial wakeup)
  // Just keeping the UART port active is enough to keep the modem awake

  // Check for OLED power button press (GPIO 0)
  static unsigned long lastButtonPress = 0;
  static bool lastButtonState = HIGH;
  bool buttonState = digitalRead(OLED_BUTTON_PIN);

  if (buttonState == LOW && lastButtonState == HIGH && (millis() - lastButtonPress > 200)) {
    // Button pressed (with debounce)

    // If screen was auto-blanked, just turn it on and reset blanking state
    if (oledBlankingActive && !oledDisplayOn) {
      setOLEDPower(true);
      oledBlankingActive = false;
      lastActivityTime = millis();  // Reset activity timer
      logSerial("[OLED] Screen turned on by button press");
    } else {
      // Normal toggle behavior (manual on/off)
      toggleOLEDPower();
      oledBlankingActive = false;   // Clear auto-blanking flag when manually controlled
      lastActivityTime = millis();  // Reset activity timer
    }

    lastButtonPress = millis();
  }
  lastButtonState = buttonState;

  // Update status LED
  updateStatusLED();

  // Update RGB LED (for blinking effects)
#if ENABLE_RGB_LED
  rgbLed.update();
#endif

  // Handle web server
  server.handleClient();

  // Handle MQTT client
  mqttLoop();

  // Handle MMDVM serial communication
  handleMMDVMSerial();

  // Check for DMR activity timeout and update OLED display
  unsigned long currentMillis = millis();

  // Handle network toggle on separate timer (always 5 seconds)
  if (enable_oled && currentMillis - lastNetworkToggle >= NETWORK_TOGGLE_INTERVAL) {
    // Cycle through header display states
    // Determine max cycle value based on connections
    bool hasWifi = wifiConnected;
    bool hasEth = false;
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
    bool hasEth = false;
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
    hasEth = eth_connected;
#endif
#endif

    int maxCycle = 1;  // Default: 2 states (network + callsign)
    if (hasWifi && hasEth) {
      maxCycle = 2;  // 3 states (wifi, eth, callsign)
    }

    oledHeaderCycle++;
    if (oledHeaderCycle > maxCycle) {
      oledHeaderCycle = 0;
    }

    // Keep old toggle for backward compatibility if needed
    oledShowEthernet = !oledShowEthernet;
    lastNetworkToggle = currentMillis;
  }

  // Update OLED display periodically (faster when DMR activity is active)
  if (enable_oled) {
    // Check if there's any active DMR transmission
    bool anyDMRActive = dmrActivity[0].active || dmrActivity[1].active;
    unsigned long oledInterval = anyDMRActive ? OLED_UPDATE_INTERVAL_ACTIVE : OLED_UPDATE_INTERVAL;

    if (currentMillis - lastOLEDUpdate >= oledInterval) {
      updateOLEDStatus();
      lastOLEDUpdate = currentMillis;
    }
  }

  // Handle OLED auto-blanking
  if (enable_oled && oledAutoBlankEnabled && oledBlankTimeout > 0) {
    // Check if there's any DMR activity
    bool anyDMRActive = dmrActivity[0].active || dmrActivity[1].active;

    // Update last activity time if there's DMR activity
    if (anyDMRActive) {
      lastActivityTime = currentMillis;

      // If screen was auto-blanked and there's activity, turn it back on
      if (oledBlankingActive && !oledDisplayOn) {
        setOLEDPower(true);
        oledBlankingActive = false;
        logSerial("[OLED] Screen turned on due to activity");
      }
    }

    // Check if we should blank the screen due to inactivity
    if (oledDisplayOn && !oledBlankingActive && (currentMillis - lastActivityTime > oledBlankTimeout)) {
      setOLEDPower(false);
      oledBlankingActive = true;
      logSerial("[OLED] Screen blanked due to inactivity");
    }
  }
  // Reset DMR TX mode if no frames received for 200ms
  if (dmrTxActive && (currentMillis - lastDMRFrameTime > 200)) {
    writeDMRStart(false, "");  // Exit TX mode
    dmrTxActive = false;
  }

  // Check for RF transmission timeout (local TX to network) and add to history
  for (int i = 0; i < 2; i++) {
    if (currentRFTx[i].active && (currentMillis - lastTxTime > 1000)) {
      // RF transmission ended (no new frames for >1 second)
      uint32_t duration = (currentMillis - currentRFTx[i].startTime) / 1000;

      // Log [END] with sequence range, similar to network RX format
      if (currentRFTx[i].lastSeq > currentRFTx[i].startSeq) {
        logSerial("[DMR] [RF->NET] Slot" + String(currentRFTx[i].slotNo) + " Seq=" + String(currentRFTx[i].startSeq) + "-" + String(currentRFTx[i].lastSeq) + " " + String(currentRFTx[i].srcId) + "->TG" + String(currentRFTx[i].dstId) + " [END]");
      }

      if (duration > 0) {  // Only log if transmission lasted at least 1 second
        addRFHistory(currentRFTx[i].srcId, currentRFTx[i].srcCallsign, currentRFTx[i].dstId,
                     currentRFTx[i].isGroup, duration, currentRFTx[i].slotNo);
      }
      currentRFTx[i].active = false;
    }
  }

  for (int i = 0; i < 2; i++) {
    // Check if DMR activity has timed out and add to history before deactivating
    if (dmrActivity[i].active && (currentMillis - dmrActivity[i].lastUpdate > DMR_ACTIVITY_TIMEOUT)) {
      // Add to history when activity times out (transmission ended)
      // ONLY add to Recent DMR Activity if it's from the network (not local RF)
      if (dmrActivity[i].srcId > 0 && dmrActivity[i].srcId != dmr_id) {
        uint32_t duration = (currentMillis - dmrActivity[i].startTime) / 1000;
        String location = "";
        if (dmrActivity[i].srcCity.length() > 0 || dmrActivity[i].srcCountry.length() > 0) {
          if (dmrActivity[i].srcCity.length() > 0) location += dmrActivity[i].srcCity;
          if (dmrActivity[i].srcCity.length() > 0 && dmrActivity[i].srcCountry.length() > 0) location += ", ";
          if (dmrActivity[i].srcCountry.length() > 0) location += dmrActivity[i].srcCountry;
        }
        addDMRHistory(dmrActivity[i].srcId, dmrActivity[i].srcCallsign, dmrActivity[i].srcName, location,
                      dmrActivity[i].dstId, dmrActivity[i].isGroup, duration, 0, 0, dmrActivity[i].slotNo);
      }
      dmrActivity[i].active = false;
    }

