javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
    // Also check transmission timeout and log the end
    if (currentTx[i].active && (currentMillis - dmrActivity[i].lastUpdate > DMR_ACTIVITY_TIMEOUT)) {
      if (currentTx[i].lastSeq > currentTx[i].startSeq) {
        String txSummary = "[SERVER] DMR: Slot" + String(currentTx[i].slotNo) + " Seq=" + String(currentTx[i].startSeq) + "-" + String(currentTx[i].lastSeq) + " " + String(currentTx[i].srcId) + "->" + (currentTx[i].isGroup ? "TG" : "") + String(currentTx[i].dstId) + " [END]";
        logSerial(txSummary);
      }
      currentTx[i].active = false;
    }
  }

  // Handle network communication
  if (wifiConnected) {
    handleNetwork();

    // Check for DMR login timeout and retry if needed
    if (mode_dmr_enabled && !dmrLoggedIn && wifiConnected) {
      if (dmrState == DMR_STATE::WAITING_LOGIN || dmrState == DMR_STATE::WAITING_AUTH || dmrState == DMR_STATE::WAITING_CONFIG) {

        if (currentMillis - lastLoginAttempt >= DMR_LOGIN_TIMEOUT) {
          if (loginAttempts < DMR_LOGIN_MAX_RETRIES) {
            loginAttempts++;
            logSerial("[SERVER] DMR login timeout - retrying (" + String(loginAttempts) + "/" + String(DMR_LOGIN_MAX_RETRIES) + ")");
            dmrLoginStatus = "[SERVER] Retrying... (" + String(loginAttempts) + "/" + String(DMR_LOGIN_MAX_RETRIES) + ")";
            connectToDMRNetwork();
            lastLoginAttempt = currentMillis;
            if (enable_oled) {
              updateOLEDStatus();  // Update display to show retry status
            }
          } else {
            logSerial("[SERVER] DMR login failed after " + String(DMR_LOGIN_MAX_RETRIES) + " attempts");
            dmrLoginStatus = "[SERVER] Login Failed";
            dmrState = DMR_STATE::DISCONNECTED;
            if (enable_oled) {
              updateOLEDStatus();  // Update display to show failure
            }
          }
        }
      }
    }

    // Send keepalive packets only if DMR mode is enabled and connected
    if (mode_dmr_enabled && dmrLoggedIn) {
      if (currentMillis - lastKeepalive >= NETWORK_KEEPALIVE_INTERVAL) {
        sendDMRKeepalive();
        lastKeepalive = currentMillis;
      }
    }
  }

  // Small delay to prevent watchdog issues
  delay(1);
}

void setupWiFi() {
  Serial.print("[WiFi] Connecting to WiFi: " + String(ssid));

  setLEDMode(LED_MODE::FAST_BLINK);  // Fast blink while connecting

  // Prevent ESP32 WiFi library from auto-connecting with stored credentials
  WiFi.mode(WIFI_STA);
  WiFi.persistent(false);        // Disable WiFi credential storage in flash (must be before disconnect/begin)
  WiFi.setAutoReconnect(false);  // Disable auto-reconnect to prevent using old credentials
  WiFi.disconnect(true, true);   // Disconnect and erase any stored credentials from WiFi library
  delay(100);

  WiFi.setHostname(device_hostname.c_str());                        // Set WiFi hostname (must be before WiFi.begin)
  WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE, INADDR_NONE);  // Clear any previous config
  WiFi.setHostname(device_hostname.c_str());                        // Set hostname again after config
  WiFi.begin(ssid, password);

  int attempts = 0;
  while (WiFi.status() != WL_CONNECTED && attempts < 30) {
    updateStatusLED();  // Update LED during connection attempts
    delay(500);
    Serial.print(".");
    attempts++;
  }

  if (WiFi.status() == WL_CONNECTED) {
    wifiConnected = true;
    setLEDMode(LED_MODE::STEADY);  // Steady on when connected
#if ENABLE_RGB_LED
    rgbLed.setStatus(RGBLedStatus::NETWORK_CONNECTED);
#endif
    logSerial("\n[WiFi] WiFi Connected!");
    logSerial("[WiFi] IP Address: " + WiFi.localIP().toString());

    // Start UDP
    udp.begin(LOCAL_PORT);
  } else {
    logSerial("\n[WiFi] WiFi Connection Failed!");

    // Try all configured alternate WiFi networks
    for (int i = 0; i < 5; i++) {
      if (wifiNetworks[i].ssid.length() > 0) {
        logSerial("[WiFi] Trying WiFi [" + wifiNetworks[i].label + "]: " + wifiNetworks[i].ssid);
        WiFi.config(INADDR_NONE, INADDR_NONE, INADDR_NONE, INADDR_NONE);  // Clear any previous config
        WiFi.setHostname(device_hostname.c_str());                        // Set WiFi hostname
        WiFi.begin(wifiNetworks[i].ssid.c_str(), wifiNetworks[i].password.c_str());

        attempts = 0;
        while (WiFi.status() != WL_CONNECTED && attempts < 30) {
          updateStatusLED();  // Update LED during connection attempts
          delay(500);
          Serial.print(".");
          attempts++;
        }

        if (WiFi.status() == WL_CONNECTED) {
          wifiConnected = true;
          setLEDMode(LED_MODE::STEADY);  // Steady on when connected
#if ENABLE_RGB_LED
          rgbLed.setStatus(RGBLedStatus::NETWORK_CONNECTED);
#endif
          logSerial("\n[WiFi] WiFi Connected [" + wifiNetworks[i].label + "]!");
          logSerial("[WiFi] IP Address: " + WiFi.localIP().toString());
          udp.begin(LOCAL_PORT);
          return;
        }
      }
    }

    // If all fails, start Access Point
    logSerial("[WiFi] Starting Access Point mode...");
    setupAccessPoint();
  }
}

void setupAccessPoint() {
  WiFi.mode(WIFI_AP);
  WiFi.softAP(ap_ssid, ap_password);

  setLEDMode(LED_MODE::SLOW_BLINK);  // Slow blink in AP mode
#if ENABLE_RGB_LED
  rgbLed.setStatus(RGBLedStatus::AP_MODE);
#endif

  IPAddress IP = WiFi.softAPIP();
  logSerial("[WiFi] AP IP address: " + IP.toString());
  logSerial("[WiFi] AP SSID: " + String(ap_ssid));
  logSerial("[WiFi] AP Password: " + String(ap_password));

  apMode = true;
}

#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
void WiFiEvent(arduino_event_id_t event) {
  switch (event) {
    case ARDUINO_EVENT_ETH_START:
      logSerial("[ETH] ETH Started");
      ETH.setHostname(device_hostname.c_str());
      break;
    case ARDUINO_EVENT_ETH_CONNECTED:
      logSerial("[ETH] ETH Connected");
      break;
    case ARDUINO_EVENT_ETH_GOT_IP:
      logSerial("[ETH] ETH MAC: " + ETH.macAddress());
      logSerial("[ETH] ETH IPv4: " + ETH.localIP().toString());
      if (ETH.fullDuplex()) {
        logSerial("[ETH] ETH Mode: FULL_DUPLEX");
      }
      logSerial("[ETH] ETH Speed: " + String(ETH.linkSpeed()) + "Mbps");
      logSerial("[ETH] ETH Gateway: " + ETH.gatewayIP().toString());
      eth_connected = true;
      wifiConnected = true;
      setLEDMode(LED_MODE::STEADY);
#if ENABLE_RGB_LED
      rgbLed.setStatus(RGBLedStatus::NETWORK_CONNECTED);
#endif

      // Start UDP for DMR network
      udp.begin(LOCAL_PORT);
      logSerial("[NETWORK] UDP started on port " + String(LOCAL_PORT));
      break;
    case ARDUINO_EVENT_ETH_DISCONNECTED:
      logSerial("[ETH] ETH Disconnected");
      eth_connected = false;
      // Don't touch wifiConnected - WiFi may still be active
#if ENABLE_RGB_LED
      // Only set disconnected status if WiFi is also not connected
      if (!wifiConnected) {
        rgbLed.setStatus(RGBLedStatus::DISCONNECTED);
      }
#endif
      break;
    case ARDUINO_EVENT_ETH_STOP:
      logSerial("[ETH] ETH Stopped");
      eth_connected = false;
      // Don't touch wifiConnected - WiFi may still be active
      break;
    default:
      break;
  }
}
#endif  // LILYGO_T_ETH_ELITE_ESP32S3_MMDVM

#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
void setupEthernet() {
  logSerial("[ETH] Initializing Ethernet (LILYGO T-ETH-ELITE)...");

