javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  WiFi.onEvent(WiFiEvent);

  setLEDMode(LED_MODE::FAST_BLINK);

#ifdef ETH_POWER_PIN
  pinMode(ETH_POWER_PIN, OUTPUT);
  digitalWrite(ETH_POWER_PIN, HIGH);
#endif

  // ESP32-S3 uses W5500 Ethernet chip
  if (!ETH.begin(ETH_PHY_W5500, 1, ETH_CS_PIN, ETH_INT_PIN, ETH_RST_PIN,
                 SPI3_HOST,
                 ETH_SCLK_PIN, ETH_MISO_PIN, ETH_MOSI_PIN)) {
    logSerial("[ETH] ETH start Failed!");
    logSerial("[ETH] ERROR: Could not initialize Ethernet hardware!");
    logSerial("[ETH] Please check your wiring and board configuration.");
  } else {
    logSerial("[ETH] ETH initialization started");
    logSerial("[ETH] Ethernet will connect in background...");
    // Give it a moment to start connecting
    delay(2000);
  }
}
#endif  // LILYGO_T_ETH_ELITE_ESP32S3_MMDVM

void setupMMDVM() {
  logSerial("[MODEM] Initializing MMDVM...");

  // Wake up MMDVM by starting continuous serial on GPIO 13
  // The modem needs ongoing UART activity on GPIO 13 to wake up and stay active
  logSerial("[MODEM] Starting MMDVM wakeup serial on GPIO " + String(MMDVM_WAKEUP_PIN) + "...");

  MMDVMWakeup.begin(115200, SERIAL_8N1, 1, MMDVM_WAKEUP_PIN);  // RX=1, TX=13
  mmdvmWakeupActive = true;
  delay(100);

  // Send initial wakeup burst and try to get version from wakeup responses
  uint8_t wakeCmd[] = { MMDVM_FRAME_START, 0x03, CMD_GET_VERSION };
  bool versionFromWakeup = false;
  uint8_t wakeRxBuffer[256];
  int wakeRxPtr = 0;

  for (int i = 0; i < 20 && !versionFromWakeup; i++) {
    MMDVMWakeup.write(wakeCmd, 3);
    MMDVMWakeup.flush();
    delay(100);  // Longer delay to allow response

    // Check for response on wakeup serial
    unsigned long wakeTimeout = millis() + 50;
    while (millis() < wakeTimeout && MMDVMWakeup.available()) {
      uint8_t byte = MMDVMWakeup.read();

      if (wakeRxPtr == 0 && byte != MMDVM_FRAME_START) {
        continue;
      }

      wakeRxBuffer[wakeRxPtr++] = byte;

      if (wakeRxPtr >= 2) {
        uint8_t frameLength = wakeRxBuffer[1];

        if (wakeRxPtr >= frameLength) {
          if (wakeRxPtr >= 3 && wakeRxBuffer[2] == CMD_GET_VERSION && wakeRxPtr > 4) {
            modemFirmwareVersion = "";  // Clear existing version
            for (int j = 4; j < wakeRxPtr && wakeRxBuffer[j] != 0x00; j++) {
              if (wakeRxBuffer[j] >= 32 && wakeRxBuffer[j] < 127) {
                modemFirmwareVersion += (char)wakeRxBuffer[j];
              }
            }
            logSerial("[MODEM] Modem Firmware (from wakeup): " + modemFirmwareVersion);
            versionFromWakeup = true;
          }
          wakeRxPtr = 0;
        }
      }

      if (wakeRxPtr >= sizeof(wakeRxBuffer)) {
        wakeRxPtr = 0;
      }
    }
  }

  logSerial("[MODEM] MMDVM wakeup active (SVC LED should be blinking)");

  // Clear any pending data from wakeup responses
  while (MMDVM_SERIAL.available()) {
    MMDVM_SERIAL.read();
  }

  delay(1000);  // Give modem more time to stabilize

  // If we didn't get version from wakeup, try main UART
  if (!versionFromWakeup) {
    logSerial("[MODEM] Requesting modem firmware version on main UART...");
    sendMMDVMCommand(CMD_GET_VERSION, NULL, 0);
    MMDVM_SERIAL.flush();

    // Wait for version response
    unsigned long versionTimeout = millis() + 3000;  // 3 second timeout
    bool versionReceived = false;
    uint8_t tempRxBuffer[256];
    int tempRxPtr = 0;

    while (millis() < versionTimeout && !versionReceived) {
      if (MMDVM_SERIAL.available()) {
        uint8_t byte = MMDVM_SERIAL.read();

        if (tempRxPtr == 0 && byte != MMDVM_FRAME_START) {
          continue;
        }

        tempRxBuffer[tempRxPtr++] = byte;

        if (tempRxPtr >= 2) {
          uint8_t frameLength = tempRxBuffer[1];

          if (tempRxPtr >= frameLength) {
            // Check if this is a version response
            if (tempRxPtr >= 3 && tempRxBuffer[2] == CMD_GET_VERSION) {
              modemFirmwareVersion = "";  // Clear existing version
              for (int i = 4; i < tempRxPtr && tempRxBuffer[i] != 0x00; i++) {
                if (tempRxBuffer[i] >= 32 && tempRxBuffer[i] < 127) {
                  modemFirmwareVersion += (char)tempRxBuffer[i];
                }
              }
              logSerial("[MODEM] Modem Firmware: " + modemFirmwareVersion);
              versionReceived = true;
            }
            tempRxPtr = 0;
          }
        }

        if (tempRxPtr >= sizeof(tempRxBuffer)) {
          tempRxPtr = 0;
        }
      }
      delay(10);
    }

    if (!versionReceived) {
      logSerial("[MODEM] Warning: No version response from modem");
    }
  }

  // IMPORTANT: Set frequency BEFORE config (per MMDVMHost sequence)
  // This ensures the radio is tuned before mode-specific settings are applied
  uint8_t rfPower = 100;  // RF power level (0-255, typically 100)
  logSerial("[MODEM] Setting modem frequency...");
  sendFrequency(dmr_rx_freq, dmr_tx_freq, rfPower);
  delay(100);

  // Set configuration (must be at least 23 bytes per firmware)
  uint8_t config[23];
  memset(config, 0, sizeof(config));

  // Byte 0: Flags (bit 7=simplex, bit 4=debug, bit 3=YSF low dev)
  config[0] = 0x80;  // Simplex mode

  // Byte 1: Mode enables (bitfield)
  uint8_t modeEnables = 0x00;
  if (mode_dstar_enabled) modeEnables |= 0x01;
  if (mode_dmr_enabled) modeEnables |= 0x02;
  if (mode_ysf_enabled) modeEnables |= 0x04;
  if (mode_p25_enabled) modeEnables |= 0x08;
  if (mode_nxdn_enabled) modeEnables |= 0x10;
  if (mode_pocsag_enabled) modeEnables |= 0x20;
  config[1] = modeEnables;

  // Byte 2: TX delay (0-50)
  config[2] = MMDVM_TX_DELAY;

  // Byte 3: Modem state (0x00=IDLE, 0x01=DSTAR, 0x02=DMR, etc.)
  uint8_t modemState = 0x00;                        // Start in IDLE, will set mode separately
  if (mode_dmr_enabled) modemState = 0x02;          // DMR
  else if (mode_dstar_enabled) modemState = 0x01;   // D-Star
  else if (mode_ysf_enabled) modemState = 0x03;     // YSF
  else if (mode_p25_enabled) modemState = 0x04;     // P25
  else if (mode_nxdn_enabled) modemState = 0x05;    // NXDN
  else if (mode_pocsag_enabled) modemState = 0x07;  // POCSAG
  config[3] = modemState;

  // Byte 4: RX level
  config[4] = MMDVM_RX_LEVEL;

  // Byte 5: CW ID TX level (shifted by 2)
  config[5] = MMDVM_TX_LEVEL;

  // Byte 6: DMR Color Code (0-15) - CRITICAL for DMR operation
  config[6] = dmr_color_code;

  // Byte 7: DMR delay (duplex only, 0 for simplex)
  config[7] = 0x00;

  // Bytes 9-21: TX levels for each mode
  config[9] = MMDVM_TX_LEVEL;   // D-Star TX level
  config[10] = MMDVM_TX_LEVEL;  // DMR TX level
  config[11] = MMDVM_TX_LEVEL;  // YSF TX level
  config[12] = MMDVM_TX_LEVEL;  // P25 TX level
  config[15] = MMDVM_TX_LEVEL;  // NXDN TX level
  config[17] = MMDVM_TX_LEVEL;  // POCSAG TX level
  config[21] = MMDVM_TX_LEVEL;  // M17 TX level

