javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  String modeStr = "IDLE";
  if (modemState == 0x02) modeStr = "DMR";
  else if (modemState == 0x01) modeStr = "D-Star";
  else if (modemState == 0x03) modeStr = "YSF";
  else if (modemState == 0x04) modeStr = "P25";
  else if (modemState == 0x05) modeStr = "NXDN";
  else if (modemState == 0x07) modeStr = "POCSAG";

  logSerial("[MODEM] Mode enables - DMR: " + String(mode_dmr_enabled ? "ON" : "OFF") + " D-Star: " + String(mode_dstar_enabled ? "ON" : "OFF") + " YSF: " + String(mode_ysf_enabled ? "ON" : "OFF") + " P25: " + String(mode_p25_enabled ? "ON" : "OFF") + " NXDN: " + String(mode_nxdn_enabled ? "ON" : "OFF") + " POCSAG: " + String(mode_pocsag_enabled ? "ON" : "OFF"));
  logSerial("[MODEM] Config byte[1] (mode enables): 0x" + String(modeEnables, HEX) + " byte[3] (state): 0x" + String(modemState, HEX));
  logSerial("[MODEM] Setting modem configuration (Mode: " + modeStr + ", Color Code: " + String(dmr_color_code) + ")...");
  sendMMDVMCommand(CMD_SET_CONFIG, config, 23);
  delay(200);  // Give modem time to configure and set mode

  // Note: Mode is set within CMD_SET_CONFIG (byte 3), no need for separate CMD_SET_MODE
  // The firmware will automatically configure the radio and set the DMR LED

  // Only mark modem as ready if we successfully received firmware version
  if (modemFirmwareVersion != "Unknown" && modemFirmwareVersion.length() > 0) {
    logSerial("[MODEM] MMDVM Initialized - Modem Ready");
    mmdvmReady = true;
  } else {
    logSerial("[MODEM] MMDVM Initialized - WARNING: No modem firmware version detected!");
    mmdvmReady = false;
  }
}

void sendMMDVMCommand(uint8_t cmd, uint8_t* data, uint16_t length) {
  uint8_t buffer[512];
  buffer[0] = MMDVM_FRAME_START;
  buffer[1] = length + 3;  // Length includes START, LEN, and CMD
  buffer[2] = cmd;

  if (data != NULL && length > 0) {
    memcpy(&buffer[3], data, length);
  }

  MMDVM_SERIAL.write(buffer, length + 3);
}

void sendFrequency(uint32_t rxFreq, uint32_t txFreq, uint8_t rfPower) {
  // CMD_SET_FREQ payload format per MMDVM_HS firmware (SerialPort.cpp line 548):
  // data[0]:    Mode/flags byte (unused in simplex mode, set to 0)
  // data[1-4]:  RX frequency in Hz (little-endian)
  // data[5-8]:  TX frequency in Hz (little-endian)
  // data[9]:    RF power level (0-255)
  // data[10-13]: POCSAG TX frequency in Hz (little-endian)
  uint8_t freqData[14];

  // Byte 0: Mode/flags (unused, set to 0)
  freqData[0] = 0x00;

  // RX Frequency (little-endian) - starts at byte 1!
  freqData[1] = (rxFreq >> 0) & 0xFF;
  freqData[2] = (rxFreq >> 8) & 0xFF;
  freqData[3] = (rxFreq >> 16) & 0xFF;
  freqData[4] = (rxFreq >> 24) & 0xFF;

  // TX Frequency (little-endian) - starts at byte 5
  freqData[5] = (txFreq >> 0) & 0xFF;
  freqData[6] = (txFreq >> 8) & 0xFF;
  freqData[7] = (txFreq >> 16) & 0xFF;
  freqData[8] = (txFreq >> 24) & 0xFF;

  // RF Power level - byte 9
  freqData[9] = rfPower;

  // POCSAG TX frequency (little-endian) - bytes 10-13, use same as TX freq
  freqData[10] = (txFreq >> 0) & 0xFF;
  freqData[11] = (txFreq >> 8) & 0xFF;
  freqData[12] = (txFreq >> 16) & 0xFF;
  freqData[13] = (txFreq >> 24) & 0xFF;

  sendMMDVMCommand(CMD_SET_FREQ, freqData, 14);

  logSerial("[MODEM] Frequency set - RX: " + String(rxFreq) + " Hz, TX: " + String(txFreq) + " Hz, Power: " + String(rfPower));
}

void writeDMRStart(bool tx, String callsign) {
  // Send DMR START command to tell modem to enter/exit TX mode
  // This is critical - without it, the modem won't transmit!
  uint8_t buffer[4];
  buffer[0] = MMDVM_FRAME_START;
  buffer[1] = 4;  // Length
  buffer[2] = CMD_DMR_START;
  buffer[3] = tx ? 0x01 : 0x00;  // 0x01 = start TX, 0x00 = stop TX

  MMDVM_SERIAL.write(buffer, 4);
  MMDVM_SERIAL.flush();

  String logMsg = tx ? "[MODEM] DMR TX START" : "[MODEM] DMR TX STOP";
  if (callsign.length() > 0) {
    logMsg += " - " + callsign;
  }
  logSerial(logMsg);
}

void handleMMDVMSerial() {
  while (MMDVM_SERIAL.available()) {
    uint8_t byte = MMDVM_SERIAL.read();

    if (rxBufferPtr == 0 && byte != MMDVM_FRAME_START) {
      continue;  // Wait for frame start
    }

    rxBuffer[rxBufferPtr++] = byte;

    // Check if we have enough bytes to read length
    if (rxBufferPtr >= 2) {
      uint8_t frameLength = rxBuffer[1];

      // Check if we have a complete frame
      if (rxBufferPtr >= frameLength) {
        processMMDVMFrame();
        rxBufferPtr = 0;
      }
    }

    // Prevent buffer overflow
    if (rxBufferPtr >= sizeof(rxBuffer)) {
      rxBufferPtr = 0;
    }
  }
}

void processMMDVMFrame() {
  if (rxBufferPtr < 3) return;

  uint8_t cmd = rxBuffer[2];

  switch (cmd) {
    case CMD_GET_VERSION:
      {
        String version = "[MODEM] MMDVM Version: ";
        for (int i = 3; i < rxBufferPtr; i++) {
          version += (char)rxBuffer[i];
        }
        logSerial(version);
      }
      break;

    case CMD_GET_STATUS:
      {
        String status = "[MODEM] MMDVM Status - Mode: " + String(rxBuffer[3]) + " TX: " + String(rxBuffer[4]) + " Overflow: " + String(rxBuffer[7]);
        logSerial(status);
      }
      break;

    case CMD_ACK:
      // Modem acknowledged a command
      logSerialVerbose("[MODEM] MMDVM ACK received");
      break;

    case CMD_NAK:
      // Modem rejected a command
      // NAK format: [START] [LEN] [NAK=0x7F] [CMD_REJECTED] [ERROR_CODE]
      if (rxBufferPtr >= 5) {
        uint8_t rejectedCmd = rxBuffer[3];
        uint8_t reason = rxBuffer[4];
        String cmdStr;
        switch (rejectedCmd) {
          case CMD_GET_VERSION: cmdStr = "GET_VERSION"; break;
          case CMD_GET_STATUS: cmdStr = "GET_STATUS"; break;
          case CMD_SET_CONFIG: cmdStr = "SET_CONFIG"; break;
          case CMD_SET_MODE: cmdStr = "SET_MODE"; break;
          case CMD_SET_FREQ: cmdStr = "SET_FREQ"; break;
          case CMD_DMR_DATA1: cmdStr = "DMR_DATA1"; break;
          case CMD_DMR_DATA2: cmdStr = "DMR_DATA2"; break;
          default: cmdStr = "0x" + String(rejectedCmd, HEX); break;
        }
        String reasonStr;
        switch (reason) {
          case 1: reasonStr = "Invalid Command"; break;
          case 2: reasonStr = "Wrong Mode"; break;
          case 3: reasonStr = "Command Too Long"; break;
          case 4: reasonStr = "Data Incorrect"; break;
          case 5: reasonStr = "Not Enough Buffer Space"; break;
          default: reasonStr = "Unknown (" + String(reason) + ")"; break;
        }
        logSerial("[MODEM] MMDVM NAK - Command: " + cmdStr + ", Reason: " + reasonStr);
      } else if (rxBufferPtr >= 4) {
        uint8_t reason = rxBuffer[3];
        String reasonStr;
        switch (reason) {
          case 1: reasonStr = "Invalid Command"; break;
          case 2: reasonStr = "Wrong Mode"; break;
          case 3: reasonStr = "Command Too Long"; break;
          case 4: reasonStr = "Data Incorrect"; break;
          case 5: reasonStr = "Not Enough Buffer Space"; break;
          default: reasonStr = "Unknown (" + String(reason) + ")"; break;
        }
        logSerial("[MODEM] MMDVM NAK - Reason: " + reasonStr);
      } else {
        logSerial("[MODEM] MMDVM NAK received");
      }
      break;

    case CMD_DMR_DATA1:
    case CMD_DMR_DATA2:
      // DMR data received from MMDVM - forward to network (TRANSMITTING)
      {
        uint8_t slot = (cmd == CMD_DMR_DATA1) ? 1 : 2;
        uint16_t dataLen = rxBufferPtr - 3;

        if (debug_dmr) {
          logSerial("[DEBUG] RX from radio: Slot " + String(slot) + ", Buffer size: " + String(rxBufferPtr) + ", Data length: " + String(dataLen) + " bytes");
          logSerial("[DEBUG] WiFi connected: " + String(wifiConnected ? "YES" : "NO"));
          logSerial("[DEBUG] DMR logged in: " + String(dmrLoggedIn ? "YES" : "NO"));
          logSerial("[DEBUG] DMR state: " + String((int)dmrState));
        }

        if (wifiConnected) {
          // Check if we're actually connected to DMR network
          if (!dmrLoggedIn) {
            logSerial("[DMR] WARNING: Data from radio but NOT logged into DMR network! State: " + String((int)dmrState));
          }

          // Build proper DMRD packet from modem data
          // rxBuffer[3..n] contains the modem data (34 bytes: 1 control + 33 DMR frame)
          uint8_t dmrdPacket[55];  // DMRD packet is always 55 bytes
          int packetLen = buildDMRDPacket(dmrdPacket, &rxBuffer[3], dataLen, slot);

          if (packetLen > 0) {
            // Send DMRD packet to network
            int udpBeginResult = udp.beginPacket(dmr_server.c_str(), dmr_port);
            if (debug_dmr) {
              logSerial("[DEBUG] UDP beginPacket result: " + String(udpBeginResult));
              logSerial("[DEBUG] Sending to: " + dmr_server + ":" + String(dmr_port));
              logSerial("[DEBUG] Built DMRD packet: " + String(packetLen) + " bytes");
            }

            size_t bytesWritten = udp.write(dmrdPacket, packetLen);
            if (debug_dmr) {
              logSerial("[DEBUG] UDP write: " + String(bytesWritten) + " bytes written");
            }

            int udpEndResult = udp.endPacket();
            if (debug_dmr) {
              logSerial("[DEBUG] UDP endPacket result: " + String(udpEndResult));
            }

            if (udpEndResult == 1) {
              // Only log individual packets in debug mode
              if (debug_dmr) {
                logSerial("[DMR] TX Slot" + String(slot) + ": " + String(packetLen) + " bytes DMRD packet sent to network (seq=" + String(dmrdPacket[4]) + ")");
              }
            } else {
              logSerial("[DMR] ERROR: Failed to send to network! UDP result: " + String(udpEndResult));
            }
          } else {
            logSerial("[DMR] ERROR: Failed to build DMRD packet!");
          }

          // Flash COS LED briefly, then restore previous state
          bool previousLedState = ledState;  // Save current LED state
          digitalWrite(COS_LED_PIN, HIGH);
#if ENABLE_RGB_LED
          rgbLed.setStatus(RGBLedStatus::TRANSMITTING);
#endif
          //delay(50); // remove short outgoing rf to network delay to improve performance
          // Restore previous LED state (WiFi status)
          digitalWrite(COS_LED_PIN, previousLedState ? HIGH : LOW);
#if ENABLE_RGB_LED
          rgbLed.setStatus(RGBLedStatus::IDLE_CONNECTED);
#endif
        } else {
          logSerial("[DMR] ERROR: Cannot send - WiFi not connected!");
        }
      }
      break;

    default:
      logSerial("[MODEM] Unknown MMDVM command: 0x" + String(cmd, HEX));
      break;
  }
}

void handleNetwork() {
  int packetSize = udp.parsePacket();
  if (packetSize) {
    uint8_t packet[512];
    int len = udp.read(packet, sizeof(packet));

    if (len > 0) {
      // Check if this is a keepalive packet first (for conditional logging)
      bool isKeepalive = (memcmp(packet, "MSTPONG", 7) == 0 && len >= 7);
      bool isDMRData = (memcmp(packet, "DMRD", 4) == 0 && len >= 55);

