javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
      // Only log hex dump for non-DMR data packets (DMR gets decoded below)
      if (!isDMRData) {
        String hexDump = "RX [" + String(len) + "]: ";
        for (int i = 0; i < min(len, 16); i++) {
          if (packet[i] < 0x10) hexDump += "0";
          hexDump += String(packet[i], HEX);
          hexDump += " ";
        }

        // Use verbose logging for keepalive packets (always USB, conditionally web)
        if (isKeepalive) {
          logSerialVerbose(hexDump);
        } else {
          logSerial("[NETWORK] " + hexDump);
        }
      }

      // Check for BrandMeister responses (binary comparison)
      if (len >= 4) {
        // Check for negative acknowledgment (MSTNAK)
        if (memcmp(packet, "MSTNAK", 6) == 0 && len >= 6) {
          dmrLoggedIn = false;
          dmrLoginStatus = "Login Failed";

          // Log which stage failed
          String stageMsg = "BrandMeister NAK at stage: ";
          switch (dmrState) {
            case DMR_STATE::WAITING_LOGIN: stageMsg += "LOGIN"; break;
            case DMR_STATE::WAITING_AUTH: stageMsg += "AUTH"; break;
            case DMR_STATE::WAITING_CONFIG: stageMsg += "CONFIG"; break;
            default: stageMsg += "UNKNOWN";
          }
          logSerial("[DMR] " + stageMsg);
          logSerial("[DMR] STOPPING - Please check configuration and reboot");

          // Stop trying to prevent ban
          dmrState = DMR_STATE::DISCONNECTED;
        }
        // Check for login acknowledgment (RPTACK)
        else if (memcmp(packet, "RPTACK", 6) == 0 && len >= 10) {
          // RPTACK response includes salt for password authentication
          memcpy(dmrSalt, packet + 6, 4);

          // Debug: Show salt
          String saltHex = "Salt: ";
          for (int i = 0; i < 4; i++) {
            if (dmrSalt[i] < 0x10) saltHex += "0";
            saltHex += String(dmrSalt[i], HEX);
          }
          logSerial("[DMR] " + saltHex);

          switch (dmrState) {
            case DMR_STATE::WAITING_LOGIN:
              logSerial("[DMR] Login ACK received (state: WAITING_LOGIN), sending auth...");
              dmrState = DMR_STATE::WAITING_AUTH;
              sendDMRAuth();
              break;
            case DMR_STATE::WAITING_AUTH:
              logSerial("[DMR] Auth ACK received (state: WAITING_AUTH), sending config...");
              dmrState = DMR_STATE::WAITING_CONFIG;
              sendDMRConfig();
              break;
            case DMR_STATE::WAITING_CONFIG:
              logSerial("[DMR] Config ACK - CONNECTED!");
              dmrLoggedIn = true;
              dmrLoginStatus = "Connected";
              dmrState = DMR_STATE::CONNECTED;
              loginAttempts = 0;  // Reset retry counter on successful login
              logSerial("[DMR] DMR Network fully connected and operational!");

              // Force immediate OLED update to show connected status
              if (enable_oled) {
                updateOLEDStatus();
                lastOLEDUpdate = millis();  // Reset timer
              }
              break;
            case DMR_STATE::DISCONNECTED:
              // Don't retry after NAK to prevent bans
              logSerial("[DMR] RPTACK received but in DISCONNECTED state - ignoring");
              break;
            default:
              logSerial("[DMR] RPTACK received in unexpected state: " + String((int)dmrState));
              break;
          }
        }
        // Check for ping response (MSTPONG)
        else if (memcmp(packet, "MSTPONG", 7) == 0 && len >= 7) {
          logSerialVerbose("Keepalive ACK");
        }
        // DMR data packet
        else if (memcmp(packet, "DMRD", 4) == 0 && len >= 55) {
          // Parse DMR packet structure
          uint8_t seqNo = packet[4];
          uint32_t srcId = (packet[5] << 16) | (packet[6] << 8) | packet[7];
          uint32_t dstId = (packet[8] << 16) | (packet[9] << 8) | packet[10];
          uint32_t rptId = (packet[11] << 24) | (packet[12] << 16) | (packet[13] << 8) | packet[14];

          uint8_t controlByte = packet[15];
          uint8_t slotNo = (controlByte & 0x80) ? 2 : 1;
          bool isGroup = (controlByte & 0x40) == 0;  // 0=Group, 1=Private
          bool dataSync = (controlByte & 0x20) != 0;
          bool voiceSync = (controlByte & 0x10) != 0;
          uint8_t dataType = controlByte & 0x0F;

          uint8_t ber = packet[53];
          uint8_t rssi = packet[54];

          // Data type names
          const char* dataTypeStr = "UNKNOWN";
          switch (dataType) {
            case 0x00: dataTypeStr = "PI_HEADER"; break;
            case 0x01: dataTypeStr = "VOICE_LC_HDR"; break;
            case 0x02: dataTypeStr = "TERM_LC"; break;
            case 0x03: dataTypeStr = "CSBK"; break;
            case 0x06: dataTypeStr = "DATA_HDR"; break;
            case 0x07: dataTypeStr = "RATE_1/2_DATA"; break;
            case 0x08: dataTypeStr = "RATE_3/4_DATA"; break;
            case 0x09: dataTypeStr = "IDLE"; break;
            case 0x0A: dataTypeStr = "RATE_1_DATA"; break;
          }

          // If it's a voice frame (no specific data type flag), show as VOICE
          if (!dataSync && voiceSync) {
            dataTypeStr = "VOICE";
          } else if (!dataSync && !voiceSync) {
            dataTypeStr = "VOICE_BURST";
          }

          // Check if this is a TERM_LC (transmission end marker)
          bool isTermLC = (dataType == 0x02);  // TERM_LC

          // Build readable log message with consolidated transmission tracking
          int txIndex = slotNo - 1;
          DMRTransmission& tx = currentTx[txIndex];

          // Check if this is a new transmission (different source/dest or was inactive)
          bool isNewTransmission = !tx.active || tx.srcId != srcId || tx.dstId != dstId;

          // TERM_LC within the same transmission is just a superframe marker, not the actual end
          // Only end transmission if we haven't seen frames for a while or source/dest changed
          if (isNewTransmission) {
            // Log the previous transmission summary if it was active
            if (tx.active && tx.lastSeq > tx.startSeq) {
              String txSummary = "[SERVER] DMR: Slot" + String(tx.slotNo) + " Seq=" + String(tx.startSeq) + "-" + String(tx.lastSeq) + " " + String(tx.srcId) + "->" + (tx.isGroup ? "TG" : "") + String(tx.dstId) + " [END]";
              logSerial(txSummary);
            }

