javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
            // Start new transmission tracking
            tx.srcId = srcId;
            tx.dstId = dstId;
            tx.slotNo = slotNo;
            tx.isGroup = isGroup;
            tx.startSeq = seqNo;
            tx.lastSeq = seqNo;
            tx.active = true;
            tx.frameType = String(dataTypeStr);

            // Log the start of transmission
            String dmrInfo = "DMR: Slot" + String(slotNo) + " Seq=" + String(seqNo) + " " + String(srcId) + "->" + (isGroup ? "TG" : "") + String(dstId) + " [START] Type=" + String(dataTypeStr);
            if (ber > 0 || rssi > 0) {
              dmrInfo += " BER=" + String(ber) + " RSSI=" + String(rssi);
            }
            logSerial("[SERVER] " + dmrInfo);
          } else {
            // Continue existing transmission - just update sequence
            tx.lastSeq = seqNo;
            // Update frame type if it changed (VOICE -> VOICE_BURST -> TERM_LC are all part of same transmission)
            if (tx.frameType != String(dataTypeStr)) {
              tx.frameType = String(dataTypeStr);
            }
            // Don't log individual frames within a transmission
          }

          // Update DMR activity tracking
          int activityIndex = slotNo - 1;  // Slot 1 = index 0, Slot 2 = index 1

          // Check if we need to add previous transmission to history (DMR ID changed)
          // ONLY add to Recent DMR Activity if it's from the network (not local RF)
          if (dmrActivity[activityIndex].active && dmrActivity[activityIndex].srcId > 0 && dmrActivity[activityIndex].srcId != srcId && dmrActivity[activityIndex].srcId != dmr_id) {
            // Previous transmission ended, add it to history
            uint32_t duration = (millis() - dmrActivity[activityIndex].startTime) / 1000;
            String location = "";
            if (dmrActivity[activityIndex].srcCity.length() > 0 || dmrActivity[activityIndex].srcCountry.length() > 0) {
              if (dmrActivity[activityIndex].srcCity.length() > 0) location += dmrActivity[activityIndex].srcCity;
              if (dmrActivity[activityIndex].srcCity.length() > 0 && dmrActivity[activityIndex].srcCountry.length() > 0) location += ", ";
              if (dmrActivity[activityIndex].srcCountry.length() > 0) location += dmrActivity[activityIndex].srcCountry;
            }
            addDMRHistory(dmrActivity[activityIndex].srcId, dmrActivity[activityIndex].srcCallsign,
                          dmrActivity[activityIndex].srcName, location, dmrActivity[activityIndex].dstId,
                          dmrActivity[activityIndex].isGroup, duration, 0, 0, dmrActivity[activityIndex].slotNo);
          }

          // Only set start time and lookup user info if this is a new transmission (not just another frame)
          if (!dmrActivity[activityIndex].active || dmrActivity[activityIndex].srcId != srcId || dmrActivity[activityIndex].dstId != dstId) {
            dmrActivity[activityIndex].startTime = millis();   // Actual transmission start time
            dmrActivity[activityIndex].lastUpdate = millis();  // Keep for timeout detection

            // Lookup detailed user information (async, will use cache if available)
            String userInfo = lookupUserInfo(srcId);
            String callsignForMqtt = "";  // Will be populated after lookup
            // userInfo format: "callsign|name|city|country" or just "callsign" for basic lookup
            int pipe1 = userInfo.indexOf('|');
            if (pipe1 > 0) {
              dmrActivity[activityIndex].srcCallsign = userInfo.substring(0, pipe1);
              int pipe2 = userInfo.indexOf('|', pipe1 + 1);
              if (pipe2 > pipe1) {
                dmrActivity[activityIndex].srcName = userInfo.substring(pipe1 + 1, pipe2);
                int pipe3 = userInfo.indexOf('|', pipe2 + 1);
                if (pipe3 > pipe2) {
                  dmrActivity[activityIndex].srcCity = userInfo.substring(pipe2 + 1, pipe3);
                  dmrActivity[activityIndex].srcCountry = userInfo.substring(pipe3 + 1);
                } else {
                  dmrActivity[activityIndex].srcCity = userInfo.substring(pipe2 + 1);
                }
              } else {
                dmrActivity[activityIndex].srcName = userInfo.substring(pipe1 + 1);
              }
            } else {
              dmrActivity[activityIndex].srcCallsign = userInfo;
            }

            // Publish to MQTT when new transmission starts with all available info
            if (dmrActivity[activityIndex].srcCallsign.length() > 0) {
              uint32_t duration = (millis() - dmrActivity[activityIndex].startTime) / 1000;
              mqttPublishSlotActivity(slotNo, srcId, dstId,
                                     dmrActivity[activityIndex].srcCallsign,
                                     dmrActivity[activityIndex].srcName,
                                     dmrActivity[activityIndex].srcCity,
                                     dmrActivity[activityIndex].srcCountry,
                                     isGroup,
                                     true,  // Always true - we only publish during active transmissions
                                     duration);
            }

            // Log with enhanced info if found
            if (dmrActivity[activityIndex].srcCallsign.length() > 0 && isNewTransmission) {
              String logMsg = "Station: " + dmrActivity[activityIndex].srcCallsign + " (" + String(srcId) + ")";
              if (dmrActivity[activityIndex].srcName.length() > 0) {
                logMsg += " - " + dmrActivity[activityIndex].srcName;
              }
              if (dmrActivity[activityIndex].srcCity.length() > 0) {
                logMsg += " from " + dmrActivity[activityIndex].srcCity;
                if (dmrActivity[activityIndex].srcCountry.length() > 0) {
                  logMsg += ", " + dmrActivity[activityIndex].srcCountry;
                }
              }
              logSerial("[INFO] " + logMsg);
            }
          } else {
            // Update lastUpdate for timeout detection but keep startTime unchanged
            dmrActivity[activityIndex].lastUpdate = millis();
          }

          dmrActivity[activityIndex].srcId = srcId;
          dmrActivity[activityIndex].dstId = dstId;
          dmrActivity[activityIndex].slotNo = slotNo;
          dmrActivity[activityIndex].isGroup = isGroup;
          dmrActivity[activityIndex].frameType = String(dataTypeStr);
          dmrActivity[activityIndex].active = true;

          // Update current talkgroup for quick status
          if (isGroup) {
            currentTalkgroup = dstId;
          }

          // Mark that we've seen TERM_LC for this transmission (but don't add to history yet)
          // History will be added when the transmission times out and becomes inactive

          // Parse and forward to MMDVM (RECEIVING from network)
          if (mmdvmReady) {
            // Extract DMR frame from network packet
            // BrandMeister DMRD packet structure (55 bytes):
            //   Bytes 0-3: "DMRD" magic
            //   Byte 4: Sequence number
            //   Bytes 5-7: Source ID
            //   Bytes 8-10: Destination ID
            //   Bytes 11-14: Repeater ID
            //   Byte 15: Control flags (slot, group/private, sync flags, data type)
            //   Bytes 16-19: Stream ID
            //   Bytes 20-52: DMR frame data (33 bytes) <-- THIS IS WHAT WE NEED
            //   Byte 53: BER
            //   Byte 54: RSSI

            // MMDVM modem expects (34 bytes):
            //   Byte 0: Control byte (usually 0x00)
            //   Bytes 1-33: DMR frame data (33 bytes from network packet bytes 20-52)
            //
            // Note: MMDVMHost uses TAG_DATA/TAG_EOT internally but does NOT send it to the modem
            // The TAG is stripped before transmission (see Modem.cpp line 1253)

            uint8_t dmrModemData[34];
            dmrModemData[0] = 0x00;                     // Control byte
            memcpy(&dmrModemData[1], &packet[20], 33);  // Copy 33-byte DMR frame

            if (debug_mmdvm) {
              // Debug logging
              String debugMsg = "TX->Modem: Slot" + String(slotNo) + " Len=" + String(34) + " Ctrl=" + String(dmrModemData[0], HEX) + " Frame[0-3]=" + String(dmrModemData[1], HEX) + " " + String(dmrModemData[2], HEX) + " " + String(dmrModemData[3], HEX) + " " + String(dmrModemData[4], HEX);
              //logSerial("[DMR] " + debugMsg);
            }

            // Only send DMR START once at beginning of transmission
            if (!dmrTxActive) {
              writeDMRStart(true, dmrActivity[activityIndex].srcCallsign);
              dmrTxActive = true;
            }
            lastDMRFrameTime = millis();

            uint8_t cmd = (slotNo == 1) ? CMD_DMR_DATA1 : CMD_DMR_DATA2;
            sendMMDVMCommand(cmd, dmrModemData, 34);

            // DMR frames are transmitted every 60ms - add delay to prevent buffer overflow
            delay(55);

#if ENABLE_RGB_LED
            rgbLed.setStatus(RGBLedStatus::RECEIVING);
            delay(5);
            rgbLed.setStatus(RGBLedStatus::IDLE_CONNECTED);
#endif
          }
        }
      }
    }
  }
}

void connectToDMRNetwork() {
  dmrLoginStatus = "Connecting...";
  dmrLoggedIn = false;
  dmrState = DMR_STATE::WAITING_LOGIN;
  lastLoginAttempt = millis();  // Start timeout timer

  logSerial("[DMR] Connecting to DMR Network...");
  logSerial("[DMR] Server: " + dmr_server + ":" + String(dmr_port));
  logSerial("[DMR] Callsign: " + dmr_callsign + " ID: " + String(dmr_id));
  if (dmr_essid > 0) {
    logSerial("[DMR] ESSID: " + String(dmr_essid));
  }

  // Create proper BrandMeister login packet
  // Format: "RPTL" (4 bytes) + DMR_ID (4 bytes binary, big-endian)
  uint8_t loginPacket[8];
  uint32_t id_to_send = dmr_id;

  // If ESSID is set, append it to the ID (e.g., 204115201 for ID 2041152 with ESSID 01)
  if (dmr_essid > 0) {
    id_to_send = dmr_id * 100 + dmr_essid;
  }

  // Packet format: "RPTL" + 4-byte binary DMR ID (big-endian)
  memcpy(loginPacket, "RPTL", 4);
  loginPacket[4] = (id_to_send >> 24) & 0xFF;  // Most significant byte
  loginPacket[5] = (id_to_send >> 16) & 0xFF;
  loginPacket[6] = (id_to_send >> 8) & 0xFF;
  loginPacket[7] = id_to_send & 0xFF;  // Least significant byte

  udp.beginPacket(dmr_server.c_str(), dmr_port);
  udp.write(loginPacket, 8);
  udp.endPacket();

  logSerial("[DMR] Login packet sent, ID: " + String(id_to_send));
}

void sendDMRAuth() {
  // Send RPTK (authorization) packet with SHA256(salt + password)
  // Format: "RPTK" + DMR_ID (4 bytes binary) + SHA256 hash (32 bytes binary)
  // SHA256 input: salt (4 binary bytes) + password (ASCII string)

  // Debug: Show password being used (with more detail)
  if (debug_password) {
    String passDebug = "Using password: length=" + String(dmr_password.length());
    if (dmr_password.length() > 0) {
      passDebug += ", last4=" + dmr_password.substring(max(0, (int)dmr_password.length() - 4));
    } else {
      passDebug += " [EMPTY!]";
    }
    logSerial("[DMR] " + passDebug);
  }

