javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  // Calculate SHA256 hash of (salt + password)
  size_t passLen = dmr_password.length();
  size_t inputLen = 4 + passLen;
  uint8_t* input = new uint8_t[inputLen];

  // Salt is 4 binary bytes, not hex string
  memcpy(input, dmrSalt, 4);
  memcpy(input + 4, dmr_password.c_str(), passLen);

  // Calculate SHA256 hash (binary output, not hex)
  uint8_t hash[32];
  mbedtls_md_context_t ctx;
  mbedtls_md_init(&ctx);
  mbedtls_md_setup(&ctx, mbedtls_md_info_from_type(MBEDTLS_MD_SHA256), 0);
  mbedtls_md_starts(&ctx);
  mbedtls_md_update(&ctx, input, inputLen);
  mbedtls_md_finish(&ctx, hash);
  mbedtls_md_free(&ctx);

  delete[] input;

  // Build RPTK packet: "RPTK" (4 bytes) + ID (4 bytes binary) + hash (32 bytes binary)
  uint8_t authPacket[40];
  uint32_t id_to_send = dmr_id;
  if (dmr_essid > 0) {
    id_to_send = dmr_id * 100 + dmr_essid;
  }

  memcpy(authPacket, "RPTK", 4);
  authPacket[4] = (id_to_send >> 24) & 0xFF;  // ID as 4 binary bytes (big-endian)
  authPacket[5] = (id_to_send >> 16) & 0xFF;
  authPacket[6] = (id_to_send >> 8) & 0xFF;
  authPacket[7] = id_to_send & 0xFF;
  memcpy(authPacket + 8, hash, 32);  // SHA256 hash as 32 binary bytes

  udp.beginPacket(dmr_server.c_str(), dmr_port);
  udp.write(authPacket, 40);
  udp.endPacket();

  logSerial("[DMR] Auth packet sent (40 bytes)");
}

void sendDMRConfig() {
  // Send RPTC (configuration) packet
  // Format: "RPTC" (4 bytes) + DMR_ID (4 bytes binary) + config string (294 bytes) = 302 bytes
  // Using larger buffer to prevent overflow during snprintf, then copy exact 294 bytes
  char configString[400];
  memset(configString, 0, sizeof(configString));

  uint32_t id_to_send = dmr_id;
  if (dmr_essid > 0) {
    id_to_send = dmr_id * 100 + dmr_essid;
  }

  // Config format (callsign + basic info) - 294 bytes
  // Format per MMDVMHost writeConfig():
  // %-8.8s%09u%09u%02u%02u%8.8s%9.9s%03d%-20.20s%-19.19s%c%-124.124s%-40.40s%-40.40s

  // Format latitude and longitude properly as floats with exact widths
  char latitude[20];
  char longitude[20];
  sprintf(latitude, "%08f", dmr_latitude);    // %08f = 8 chars total
  sprintf(longitude, "%09f", dmr_longitude);  // %09f = 9 chars total

  // Validate and limit values
  unsigned int power = dmr_power;
  if (power > 99) power = 99;
  int height = dmr_height;
  if (height > 999) height = 999;

  snprintf(configString, sizeof(configString),
           "%-8.8s%09u%09u%02u%02u%8.8s%9.9s%03d%-20.20s%-19.19s%c%-124.124s%-40.40s%-40.40s",
           dmr_callsign.c_str(),     // Callsign (8 chars, left-aligned)
           dmr_rx_freq,              // RX Frequency (9 digits)
           dmr_tx_freq,              // TX Frequency (9 digits)
           power,                    // Power (2 digits)
           dmr_color_code,           // Color Code (2 digits)
           latitude,                 // Latitude (8 chars)
           longitude,                // Longitude (9 chars)
           height,                   // Height (3 digits)
           dmr_location.c_str(),     // Location (20 chars)
           dmr_description.c_str(),  // Description (19 chars)
           '4',                      // Slots (1 char: '4' = simplex)
           dmr_url.c_str(),          // URL (124 chars)
           firmwareVersion.c_str(),  // Version (40 chars) - from firmware variable
           "MMDVM_MMDVM_HS");        // Software (40 chars)

  // Debug: Log first 100 chars of config string
  String configDebug = "Config string preview: ";
  for (int i = 0; i < min(100, (int)strlen(configString)); i++) {
    if (configString[i] >= 32 && configString[i] <= 126) {
      configDebug += (char)configString[i];
    } else {
      configDebug += ".";
    }
  }
  logSerial("[DMR] " + configDebug);
  logSerial("[DMR] Config string length: " + String(strlen(configString)));

  // Build the packet with binary ID
  uint8_t configPacket[302];
  memset(configPacket, 0, sizeof(configPacket));

  memcpy(configPacket, "RPTC", 4);
  configPacket[4] = (id_to_send >> 24) & 0xFF;  // ID as 4 binary bytes (big-endian)
  configPacket[5] = (id_to_send >> 16) & 0xFF;
  configPacket[6] = (id_to_send >> 8) & 0xFF;
  configPacket[7] = id_to_send & 0xFF;
  memcpy(configPacket + 8, configString, 294);  // Copy exactly 294 bytes

  udp.beginPacket(dmr_server.c_str(), dmr_port);
  udp.write(configPacket, 302);
  udp.endPacket();

  logSerial("[DMR] Config packet sent (302 bytes)");
}

void sendDMRKeepalive() {
  // Send keepalive/ping packet to DMR network
  // Format: "RPTPING" (7 bytes) + DMR_ID (4 bytes binary) = 11 bytes
  uint8_t keepalive[11];
  uint32_t id_to_send = dmr_id;

  if (dmr_essid > 0) {
    id_to_send = dmr_id * 100 + dmr_essid;
  }

  memcpy(keepalive, "RPTPING", 7);
  keepalive[7] = (id_to_send >> 24) & 0xFF;  // ID as 4 binary bytes (big-endian)
  keepalive[8] = (id_to_send >> 16) & 0xFF;
  keepalive[9] = (id_to_send >> 8) & 0xFF;
  keepalive[10] = id_to_send & 0xFF;

  udp.beginPacket(dmr_server.c_str(), dmr_port);
  udp.write(keepalive, 11);
  udp.endPacket();

  logSerialVerbose("Keepalive sent");
}

// ===== Build DMRD Packet for Transmission =====
// Wraps raw MMDVM modem data (34 bytes) into a proper DMRD packet (55 bytes) for the network
// MMDVM modem sends: [control byte (1)] + [33-byte DMR frame]
// DMRD packet needs: "DMRD" + seq + srcID + dstID + rptID + ctrl + streamID + 33-frame + BER + RSSI
int buildDMRDPacket(uint8_t* output, const uint8_t* modemData, uint16_t modemDataLen, uint8_t slot) {
  if (modemDataLen < 34) {
    logSerial("[ERROR] buildDMRDPacket: modem data too short (" + String(modemDataLen) + " bytes)");
    return 0;
  }

  // DMR sync patterns (MS sourced, simplex hotspot mode)
  const uint8_t MS_DATA_SYNC[] = { 0x0D, 0x5D, 0x7F, 0x77, 0xFD, 0x75, 0x70 };
  const uint8_t MS_AUDIO_SYNC[] = { 0x07, 0xF7, 0xD5, 0xDD, 0x57, 0xDF, 0xD0 };
  // Observed variant from actual radio (with color code or timing offset)
  const uint8_t MS_DATA_SYNC_ALT[] = { 0x6D, 0x5D, 0x7F, 0x77, 0xFD, 0x75, 0x7E };

  // Extract the 33-byte DMR frame (modemData[1..33])
  const uint8_t* dmrFrame = &modemData[1];

  // Check sync pattern at bytes 13-19 of the DMR frame (bytes 14-20 in modemData)
  bool isDataSync = (memcmp(&dmrFrame[13], MS_DATA_SYNC, 7) == 0) ||
                    (memcmp(&dmrFrame[13], MS_DATA_SYNC_ALT, 7) == 0);
  bool isAudioSync = (memcmp(&dmrFrame[13], MS_AUDIO_SYNC, 7) == 0);

  // Debug: print actual sync pattern on first frame of new transmission
  if (debug_dmr && (millis() - lastTxTime > 1000)) {
    String syncHex = "Sync[13-19]: ";
    for (int i = 13; i < 20; i++) {
      if (dmrFrame[i] < 0x10) syncHex += "0";
      syncHex += String(dmrFrame[i], HEX) + " ";
    }
    logSerial("[DEBUG] " + syncHex + "isDataSync=" + String(isDataSync) + " isAudioSync=" + String(isAudioSync));
  }

  // Determine data type from sync pattern
  uint8_t dataType = 0;
  uint8_t n = 0;  // Voice frame number (0-5)

  if (isDataSync) {
    // Data sync - extract data type from slot type
    // Slot type is at bytes 10-11 (embedded in the frame)
    // For now, we'll use generic data type
    dataType = 0x01;  // Assume VOICE_LC_HEADER for first data sync
  } else if (isAudioSync) {
    // Audio sync = voice sync frame
    dataType = 0xF0;  // DT_VOICE_SYNC (dummy value, will be encoded as 0x10)
  } else {
    // Voice frame - extract N from EMB
    // Voice frames have EMB (Embedded signalling) at byte 13
    n = dmrFrame[13] & 0x0F;  // Lower 4 bits = frame number
    dataType = 0xF1;          // DT_VOICE (dummy value)
  }

