javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  // Detect new transmission based on data sync (headers generate new stream ID)
  unsigned long currentTime = millis();
  bool isNewTransmission = (currentTime - lastTxTime > 1000) || isDataSync;

  if (isNewTransmission) {
    // New transmission or header - generate new stream ID and reset sequence
    txSequence = 0;
    txStreamId = random(1, 0xFFFFFFFE);  // Random stream ID (avoid 0 and 0xFFFFFFFF)

    // Start tracking RF transmission for history
    int slotIndex = slot - 1;
    currentRFTx[slotIndex].active = true;
    currentRFTx[slotIndex].srcId = dmr_id;
    currentRFTx[slotIndex].dstId = 0;  // Will be extracted from LC in frame if possible
    currentRFTx[slotIndex].slotNo = slot;
    currentRFTx[slotIndex].isGroup = true;  // Assume group call
    currentRFTx[slotIndex].startTime = currentTime;
    currentRFTx[slotIndex].srcCallsign = dmr_callsign;
    currentRFTx[slotIndex].startSeq = 0;
    currentRFTx[slotIndex].lastSeq = 0;

    // Try to extract destination TG from LC (Link Control) data
    if (isDataSync) {
      if (debug_dmr) {
        logSerial("[DEBUG] Data sync detected, calling DMRDecoder::extractLCInfo()");
      }
      DMRDecoder::LCInfo lcInfo = DMRDecoder::extractLCInfo(dmrFrame, debug_dmr);
      if (lcInfo.valid) {
        if (debug_dmr) {
          logSerial("[DEBUG] LC decode SUCCESS! dstId=" + String(lcInfo.dstId));
        }
        currentRFTx[slotIndex].dstId = lcInfo.dstId;
        currentRFTx[slotIndex].isGroup = lcInfo.isGroup;
      } else {
        if (debug_dmr) {
          logSerial("[DEBUG] LC decode FAILED - dstId will remain 0");
        }
      }
    } else {
      if (debug_dmr) {
        logSerial("[DEBUG] Not a data sync frame, skipping LC extraction");
      }
    }

    // Log [START] similar to network RX format
    String frameTypeStr = isDataSync ? "VOICE_LC_HDR" : (isAudioSync ? "VOICE_SYNC" : "VOICE");
    logSerial("[DMR] [RF->NET] Slot" + String(slot) + " Seq=" + String(txSequence) + " " + String(dmr_id) + "->TG" + String(currentRFTx[slotIndex].dstId) + " [START] Type=" + frameTypeStr);

    // Also update Live DMR Activity display (so RF TX shows in real-time on web UI and OLED)
    dmrActivity[slotIndex].active = true;
    dmrActivity[slotIndex].srcId = dmr_id;
    dmrActivity[slotIndex].dstId = currentRFTx[slotIndex].dstId;  // Use extracted TG
    dmrActivity[slotIndex].srcCallsign = dmr_callsign;
    dmrActivity[slotIndex].isGroup = currentRFTx[slotIndex].isGroup;
    dmrActivity[slotIndex].frameType = isDataSync ? "VOICE_LC_HDR" : (isAudioSync ? "VOICE_SYNC" : "VOICE");
    dmrActivity[slotIndex].startTime = currentTime;
    dmrActivity[slotIndex].lastUpdate = currentTime;
    dmrActivity[slotIndex].slotNo = slot;

    // Lookup user info for display
    String userInfo = lookupUserInfo(dmr_id);
    if (userInfo.length() > 0) {
      int pipe1 = userInfo.indexOf('|');
      if (pipe1 > 0) {
        dmrActivity[slotIndex].srcCallsign = userInfo.substring(0, pipe1);
        int pipe2 = userInfo.indexOf('|', pipe1 + 1);
        if (pipe2 > 0) {
          dmrActivity[slotIndex].srcName = userInfo.substring(pipe1 + 1, pipe2);
          int pipe3 = userInfo.indexOf('|', pipe2 + 1);
          if (pipe3 > 0) {
            dmrActivity[slotIndex].srcCity = userInfo.substring(pipe2 + 1, pipe3);
            dmrActivity[slotIndex].srcCountry = userInfo.substring(pipe3 + 1);
          }
        }
      }
    }
  }
  lastTxTime = currentTime;

  // Keep Live DMR Activity updated while transmitting (update timestamp)
  int slotIndex = slot - 1;
  if (dmrActivity[slotIndex].active && dmrActivity[slotIndex].srcId == dmr_id) {
    dmrActivity[slotIndex].lastUpdate = currentTime;
    dmrActivity[slotIndex].frameType = isDataSync ? "VOICE_LC_HDR" : (isAudioSync ? "VOICE_SYNC" : "VOICE");
  }

  // Track last sequence number for [END] logging
  if (currentRFTx[slotIndex].active) {
    currentRFTx[slotIndex].lastSeq = txSequence;
  }

  // Build DMRD packet structure (55 bytes total):
  // Bytes 0-3: "DMRD" magic (4 bytes)
  output[0] = 'D';
  output[1] = 'M';
  output[2] = 'R';
  output[3] = 'D';

  // Byte 4: Sequence number (incrementing)
  output[4] = txSequence++;

  // Bytes 5-7: Source DMR ID (our hotspot/user ID) - 3 bytes, big-endian
  uint32_t srcId = dmr_id;
  if (dmr_essid > 0) {
    srcId = dmr_id * 100 + dmr_essid;
  }
  output[5] = (srcId >> 16) & 0xFF;
  output[6] = (srcId >> 8) & 0xFF;
  output[7] = srcId & 0xFF;

  // Bytes 8-10: Destination ID - set to 0, network will extract from LC in DMR frame
  output[8] = 0x00;
  output[9] = 0x00;
  output[10] = 0x00;

  // Bytes 11-14: Repeater ID (our hotspot ID) - 4 bytes, big-endian
  uint32_t rptId = srcId;
  output[11] = (rptId >> 24) & 0xFF;
  output[12] = (rptId >> 16) & 0xFF;
  output[13] = (rptId >> 8) & 0xFF;
  output[14] = rptId & 0xFF;

  // Byte 15: Control byte
  // Bit 7: Slot (0=slot1, 1=slot2)
  // Bit 6: Group/Private call (0=group, 1=private)
  // Bit 5: Data sync flag
  // Bit 4: Voice sync flag
  // Bits 3-0: Data type or voice frame number (N)
  uint8_t controlByte = (slot == 2) ? 0x80 : 0x00;  // Bit 7: slot
  controlByte |= 0x00;                              // Bit 6: group call (0=group)

  if (isDataSync) {
    controlByte |= 0x20;               // Bit 5: data sync
    controlByte |= (dataType & 0x0F);  // Bits 0-3: data type
  } else if (isAudioSync) {
    controlByte |= 0x10;  // Bit 4: voice sync
  } else {
    controlByte |= (n & 0x0F);  // Bits 0-3: voice frame number (N)
  }

  output[15] = controlByte;

  // Bytes 16-19: Stream ID (4 bytes, big-endian)
  output[16] = (txStreamId >> 24) & 0xFF;
  output[17] = (txStreamId >> 16) & 0xFF;
  output[18] = (txStreamId >> 8) & 0xFF;
  output[19] = txStreamId & 0xFF;

  // Bytes 20-52: DMR frame data (33 bytes) - copy directly from modem
  memcpy(&output[20], dmrFrame, 33);

  // Byte 53: BER (Bit Error Rate) - set to 0 for TX
  output[53] = 0x00;

  // Byte 54: RSSI - set to 0 for TX
  output[54] = 0x00;

  return 55;  // Total packet size
}

// ===== Serial Logging Functions =====
// Log to both USB serial and web buffer
void logSerial(String message) {
  Serial.println(message);

  // Store in circular buffer for web monitor
  serialLog[serialLogIndex] = message;
  serialLogIndex = (serialLogIndex + 1) % SERIAL_LOG_SIZE;
}

// Log with verbose flag - always to USB serial, conditionally to web buffer
void logSerialVerbose(String message) {
  // Only log network debug messages if debug_network is enabled
  if (debug_network) {
    Serial.println(message);
  }

  // Also store in web buffer if verbose logging is enabled
  if (verbose_logging) {
    serialLog[serialLogIndex] = message;
    serialLogIndex = (serialLogIndex + 1) % SERIAL_LOG_SIZE;
  }
}

#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
// ===== SD Card Helper Functions =====
bool writeSDFile(const char* path, const char* data) {
  if (!sdCardAvailable) return false;

