javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  File file = SD.open(path, FILE_WRITE);
  if (!file) {
    logSerial("[SD] Failed to open file for writing: " + String(path));
    return false;
  }

  if (file.print(data)) {
    file.close();
    return true;
  } else {
    logSerial("[SD] Write failed");
    file.close();
    return false;
  }
}

String readSDFile(const char* path) {
  if (!sdCardAvailable) return "";

  File file = SD.open(path);
  if (!file) {
    return "";
  }

  String content = "";
  while (file.available()) {
    content += (char)file.read();
  }
  file.close();
  return content;
}

bool appendSDFile(const char* path, const char* data) {
  if (!sdCardAvailable) return false;

  File file = SD.open(path, FILE_APPEND);
  if (!file) {
    logSerial("[SD] Failed to open file for appending: " + String(path));
    return false;
  }

  if (file.print(data)) {
    file.close();
    return true;
  } else {
    logSerial("[SD] Append failed");
    file.close();
    return false;
  }
}

bool deleteSDFile(const char* path) {
  if (!sdCardAvailable) return false;
  return SD.remove(path);
}

bool sdFileExists(const char* path) {
  if (!sdCardAvailable) return false;
  return SD.exists(path);
}
#endif

// ===== MQTT Functions =====
void mqttCallback(char* topic, byte* payload, unsigned int length) {
  // MQTT message received callback (for future use - subscriptions)
  String message = "";
  for (unsigned int i = 0; i < length; i++) {
    message += (char)payload[i];
  }
  logSerial("[MQTT] Message on topic '" + String(topic) + "': " + message);
}

bool mqttConnect() {
  if (!mqtt_enabled || mqtt_broker.length() == 0) {
    return false;
  }

  if (!wifiConnected) {
    return false;
  }

  // Limit reconnect attempts
  if (millis() - lastMqttConnectAttempt < 5000) {
    return false;  // Don't retry more than once every 5 seconds
  }
  lastMqttConnectAttempt = millis();
  mqttConnectAttempts++;

  logSerial("[MQTT] Connecting to broker: " + mqtt_broker + ":" + String(mqtt_port));

  mqttClient.setServer(mqtt_broker.c_str(), mqtt_port);
  mqttClient.setCallback(mqttCallback);
  mqttClient.setKeepAlive(60);
  mqttClient.setSocketTimeout(10);

  bool connected = false;
  if (mqtt_username.length() > 0) {
    // Set Last Will Testament (LWT) - notify when device goes offline
    String lwtTopic = mqtt_topic_prefix + "/availability";
    connected = mqttClient.connect(mqtt_client_id.c_str(), mqtt_username.c_str(),
                                    mqtt_password.c_str(), lwtTopic.c_str(), 0, true, "offline");
  } else {
    String lwtTopic = mqtt_topic_prefix + "/availability";
    connected = mqttClient.connect(mqtt_client_id.c_str(), NULL, NULL,
                                    lwtTopic.c_str(), 0, true, "offline");
  }

  if (connected) {
    mqttConnected = true;
    lastMqttError = "";
    logSerial("[MQTT] Connected successfully (attempts: " + String(mqttConnectAttempts) + ")");

    // Publish online status
    String availTopic = mqtt_topic_prefix + "/availability";
    mqttClient.publish(availTopic.c_str(), "online", true);

    // Publish initial status immediately upon connection
    mqttPublishSystemInfo();
    mqttPublishHardwareModem();
    mqttPublishNetworkWifi();
    mqttPublishNetworkDMR();
    mqttPublishMMDVMConfig();
    mqttPublishStationInfo();
    lastMqttPublish = millis();  // Reset timer so next publish happens after interval

    return true;
  } else {
    mqttConnected = false;
    int state = mqttClient.state();
    String errorMsg = "Connection failed, state: " + String(state);
    lastMqttError = errorMsg;
    logSerial("[MQTT] " + errorMsg);
    return false;
  }
}

void mqttPublishSystemInfo() {
  if (!mqttConnected || !mqttClient.connected()) return;

  String topic = mqtt_topic_prefix + "/system/status";

  // Calculate uptime breakdown
  unsigned long uptimeSeconds = millis() / 1000;
  unsigned long days = uptimeSeconds / 86400;
  unsigned long hours = (uptimeSeconds % 86400) / 3600;
  unsigned long minutes = (uptimeSeconds % 3600) / 60;
  unsigned long seconds = uptimeSeconds % 60;

  // Calculate memory stats
  uint32_t freeHeap = ESP.getFreeHeap();
  uint32_t heapSize = ESP.getHeapSize();
  uint32_t minFreeHeap = ESP.getMinFreeHeap();
  float freeHeapKB = freeHeap / 1024.0;
  float heapSizeKB = heapSize / 1024.0;
  float minFreeHeapKB = minFreeHeap / 1024.0;
  uint8_t freeHeapPercent = (freeHeap * 100) / heapSize;

  // PSRAM stats
  uint32_t psramSize = ESP.getPsramSize();
  uint32_t freePsram = ESP.getFreePsram();
  float psramSizeMB = psramSize / (1024.0 * 1024.0);
  float freePsramKB = freePsram / 1024.0;

  // Flash stats
  uint32_t flashSize = ESP.getFlashChipSize();
  uint32_t flashSpeed = ESP.getFlashChipSpeed() / 1000000;
  uint32_t sketchSize = ESP.getSketchSize();
  uint32_t freeSketchSpace = ESP.getFreeSketchSpace();
  float flashSizeMB = flashSize / (1024.0 * 1024.0);
  float sketchSizeKB = sketchSize / 1024.0;
  float freeSketchSpaceKB = freeSketchSpace / 1024.0;

  String payload = "{";
  payload += "\"callsign\":\"" + dmr_callsign + "\",";
  payload += "\"dmr_id\":" + String(dmr_id) + ",";
  payload += "\"hostname\":\"" + device_hostname + "\",";

  // Uptime object
  payload += "\"uptime\":{";
  payload += "\"seconds\":" + String(uptimeSeconds) + ",";
  payload += "\"days\":" + String(days) + ",";
  payload += "\"hours\":" + String(hours) + ",";
  payload += "\"minutes\":" + String(minutes) + ",";
  payload += "\"secondsRemaining\":" + String(seconds);
  payload += "},";

  // Chip object
  payload += "\"chip\":{";
  payload += "\"model\":\"" + String(ESP.getChipModel()) + "\",";
  payload += "\"revision\":" + String(ESP.getChipRevision()) + ",";
  payload += "\"cores\":" + String(ESP.getChipCores()) + ",";
  payload += "\"cpuFreqMHz\":" + String(ESP.getCpuFreqMHz());
  payload += "},";

  // Memory object
  payload += "\"memory\":{";
  payload += "\"freeHeapKB\":" + String(freeHeapKB, 1) + ",";
  payload += "\"freeHeapPercent\":" + String(freeHeapPercent) + ",";
  payload += "\"minFreeHeapKB\":" + String(minFreeHeapKB, 1) + ",";
  payload += "\"heapSizeKB\":" + String(heapSizeKB, 1) + ",";
  payload += "\"psramSizeMB\":" + String(psramSizeMB, 0) + ",";
  payload += "\"freePsramKB\":" + String(freePsramKB, 1);
  payload += "},";

  // Flash object
  payload += "\"flash\":{";
  payload += "\"sizeMB\":" + String(flashSizeMB, 0) + ",";
  payload += "\"speedMHz\":" + String(flashSpeed) + ",";
  payload += "\"sketchSizeKB\":" + String(sketchSizeKB, 1) + ",";
  payload += "\"freeSketchSpaceKB\":" + String(freeSketchSpaceKB, 1);
  payload += "},";

  // Firmware object
  payload += "\"firmware\":{";
  payload += "\"sdkVersion\":\"" + String(ESP.getSdkVersion()) + "\",";
  payload += "\"version\":\"" + String(FIRMWARE_VERSION) + "\",";
  payload += "\"buildDate\":\"" + String(__DATE__) + " " + String(__TIME__) + "\"";
  payload += "}";

