javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  payload += "}";

  mqttClient.publish(topic.c_str(), payload.c_str());
}

void mqttPublishHardwareModem() {
  if (!mqttConnected || !mqttClient.connected()) return;

  String topic = mqtt_topic_prefix + "/hardware/modem";

  // Parse modem firmware version string
  // Example: "MMDVM_HS_Hat-v1.6.1 20231115_WPSD 14.7456MHz ADF7021 FW by CA6JAU, G4KLX, W0CHP. GitID #7e16099"
  String hardware = "Unknown";
  String version = "Unknown";
  String buildDate = "Unknown";
  String crystal = "Unknown";
  String transceiver = "Unknown";
  String author = "Unknown";
  String gitId = "Unknown";

  if (modemFirmwareVersion != "Unknown" && modemFirmwareVersion.length() > 0) {
    String fwStr = modemFirmwareVersion;

    // Extract hardware (before "-v" or first space)
    int vPos = fwStr.indexOf("-v");
    if (vPos > 0) {
      hardware = fwStr.substring(0, vPos);
      fwStr = fwStr.substring(vPos + 2); // Skip "-v"
    } else {
      int spacePos = fwStr.indexOf(' ');
      if (spacePos > 0) {
        hardware = fwStr.substring(0, spacePos);
        fwStr = fwStr.substring(spacePos + 1);
      }
    }

    // Extract version (digits and dots until space)
    int spacePos = fwStr.indexOf(' ');
    if (spacePos > 0) {
      version = fwStr.substring(0, spacePos);
      fwStr = fwStr.substring(spacePos + 1);
    }

    // Extract build date (8 digits, may have suffix like _WPSD)
    spacePos = fwStr.indexOf(' ');
    if (spacePos > 0) {
      String dateStr = fwStr.substring(0, spacePos);

      // Check if first 8 characters are digits (YYYYMMDD)
      if (dateStr.length() >= 8) {
        bool isValidDate = true;
        for (int i = 0; i < 8; i++) {
          if (!isdigit(dateStr.charAt(i))) {
            isValidDate = false;
            break;
          }
        }

        if (isValidDate) {
          // Format YYYYMMDD to YYYY-MM-DD (ignore any suffix like _WPSD)
          buildDate = dateStr.substring(0, 4) + "-" + dateStr.substring(4, 6) + "-" + dateStr.substring(6, 8);
        }
      }
      fwStr = fwStr.substring(spacePos + 1);
    }

    // Extract crystal frequency (number followed by MHz)
    int mhzPos = fwStr.indexOf("MHz");
    if (mhzPos > 0) {
      int startPos = 0;
      for (int i = mhzPos - 1; i >= 0; i--) {
        if (fwStr.charAt(i) == ' ') {
          startPos = i + 1;
          break;
        }
      }
      crystal = fwStr.substring(startPos, mhzPos + 3);
      fwStr = fwStr.substring(mhzPos + 3);
    }

    // Extract transceiver (word after MHz, before " FW")
    fwStr.trim();
    int fwPos = fwStr.indexOf(" FW");
    if (fwPos > 0) {
      // Get the first word (transceiver name)
      spacePos = fwStr.indexOf(' ');
      if (spacePos > 0) {
        transceiver = fwStr.substring(0, spacePos);
      } else {
        // No space found, use everything before " FW"
        transceiver = fwStr.substring(0, fwPos);
      }
      fwStr = fwStr.substring(fwPos + 3); // Skip " FW"
    }

    // Extract author (after "by " before " GitID")
    int byPos = fwStr.indexOf("by ");
    int gitPos = fwStr.indexOf(" GitID");
    if (byPos >= 0 && gitPos > byPos) {
      author = fwStr.substring(byPos + 3, gitPos);
      author.trim();
    }

    // Extract Git ID (after "GitID ")
    gitPos = fwStr.indexOf("GitID ");
    if (gitPos >= 0) {
      gitId = fwStr.substring(gitPos + 6);
      gitId.trim();
    }
  }

  // Build JSON payload (without rawVersion)
  String payload = "{";
  payload += "\"ready\":" + String(mmdvmReady ? "true" : "false") + ",";
  payload += "\"type\":\"" + modem_type + "\",";
  payload += "\"hardware\":\"" + hardware + "\",";
  payload += "\"firmwareVersion\":\"" + version + "\",";
  payload += "\"buildDate\":\"" + buildDate + "\",";
  payload += "\"crystal\":\"" + crystal + "\",";
  payload += "\"transceiver\":\"" + transceiver + "\",";
  payload += "\"author\":\"" + author + "\",";
  payload += "\"gitId\":\"" + gitId + "\"";
  payload += "}";

  mqttClient.publish(topic.c_str(), payload.c_str());
}

void mqttPublishNetworkWifi() {
  if (!mqttConnected || !mqttClient.connected()) return;

  String topic = mqtt_topic_prefix + "/network/wifi";
  String payload = "{";
  payload += "\"connected\":" + String(wifiConnected ? "true" : "false") + ",";
  payload += "\"apMode\":" + String(apMode ? "true" : "false") + ",";
  payload += "\"ssid\":\"" + String(wifiConnected ? WiFi.SSID() : (apMode ? String(AP_SSID) : "")) + "\",";
  payload += "\"ip\":\"" + (wifiConnected ? WiFi.localIP().toString() : (apMode ? WiFi.softAPIP().toString() : "")) + "\",";
  payload += "\"rssi\":" + String(wifiConnected ? WiFi.RSSI() : 0) + ",";
  payload += "\"mac\":\"" + WiFi.macAddress() + "\"";
  payload += "}";

  mqttClient.publish(topic.c_str(), payload.c_str());
}

void mqttPublishNetworkDMR() {
  if (!mqttConnected || !mqttClient.connected()) return;

  String topic = mqtt_topic_prefix + "/network/dmr";
  String payload = "{";
  payload += "\"loggedIn\":" + String(dmrLoggedIn ? "true" : "false") + ",";
  payload += "\"status\":\"" + dmrLoginStatus + "\",";
  payload += "\"server\":\"" + dmr_server + "\",";
  payload += "\"callsign\":\"" + dmr_callsign + "\",";
  payload += "\"dmrId\":" + String(dmr_id) + ",";
  payload += "\"essid\":" + String(dmr_essid) + ",";
  payload += "\"currentTalkgroup\":" + String(currentTalkgroup) + ",";
  payload += "\"colorCode\":" + String(dmr_color_code);
  payload += "}";

  mqttClient.publish(topic.c_str(), payload.c_str());
}

void mqttPublishMMDVMConfig() {
  if (!mqttConnected || !mqttClient.connected()) return;

  String topic = mqtt_topic_prefix + "/mmdvm/config";
  String payload = "{";
  payload += "\"ready\":" + String(mmdvmReady ? "true" : "false") + ",";
  payload += "\"rxFreq\":" + String(dmr_rx_freq / 1000000.0, 4) + ",";  // Convert Hz to MHz with 4 decimals
  payload += "\"txFreq\":" + String(dmr_tx_freq / 1000000.0, 4) + ",";  // Convert Hz to MHz with 4 decimals
  payload += "\"colorCode\":" + String(dmr_color_code) + ",";
  payload += "\"power\":" + String(dmr_power);
  payload += "}";

  mqttClient.publish(topic.c_str(), payload.c_str());
}

void mqttPublishStationInfo() {
  if (!mqttConnected || !mqttClient.connected()) return;

