javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  String topic = mqtt_topic_prefix + "/station/info";
  String payload = "{";
  payload += "\"callsign\":\"" + dmr_callsign + "\",";
  payload += "\"dmrId\":" + String(dmr_id) + ",";
  payload += "\"essid\":" + String(dmr_essid) + ",";
  payload += "\"location\":\"" + dmr_location + "\",";
  payload += "\"isDefaultCallsign\":" + String((dmr_callsign == String(DMR_CALLSIGN)) ? "true" : "false");
  payload += "}";

  mqttClient.publish(topic.c_str(), payload.c_str());
}

void mqttPublishSlotActivity(int slot, uint32_t srcId, uint32_t dstId, const String& callsign,
                              const String& name = "", const String& city = "", const String& country = "", bool isGroup = true,
                              bool active = true, uint32_t duration = 0) {
  if (!mqttConnected || !mqttClient.connected()) return;

  String topic = mqtt_topic_prefix + "/slot" + String(slot) + "/activity";
  String payload = "{";
  payload += "\"slot\":" + String(slot) + ",";
  payload += "\"active\":" + String(active ? "true" : "false") + ",";

  // Only include detailed info if transmission is active
  if (active) {
    payload += "\"src_id\":" + String(srcId) + ",";
    payload += "\"dst_id\":" + String(dstId) + ",";
    payload += "\"callsign\":\"" + callsign + "\",";

    // Add name if available
    if (name.length() > 0) {
      payload += "\"name\":\"" + name + "\",";
    }

    // Add location info if available
    if (city.length() > 0) {
      payload += "\"city\":\"" + city + "\",";
    }
    if (country.length() > 0) {
      payload += "\"country\":\"" + country + "\",";
    }

    // Add call type (group or private)
    payload += "\"call_type\":\"" + String(isGroup ? "group" : "private") + "\",";

    // Add duration
    payload += "\"duration\":" + String(duration) + ",";
  }

  payload += "\"timestamp\":" + String(millis() / 1000);
  payload += "}";

  mqttClient.publish(topic.c_str(), payload.c_str());
}

void mqttLoop() {
  if (!mqtt_enabled) return;

  // Try to connect if not connected
  if (!mqttConnected || !mqttClient.connected()) {
    mqttConnected = false;
    mqttConnect();
    return;
  }

  // Handle MQTT client loop
  mqttClient.loop();

  // Periodic publishing
  if (millis() - lastMqttPublish >= mqtt_publish_interval) {
    lastMqttPublish = millis();

    mqttPublishSystemInfo();
    mqttPublishHardwareModem();
    mqttPublishNetworkWifi();
    mqttPublishNetworkDMR();
    mqttPublishMMDVMConfig();
    mqttPublishStationInfo();
  }
}

// ===== Configuration Load/Save =====
void loadConfig() {
  preferences.begin("mmdvm", false);

  // Load DMR settings if they exist
  if (preferences.isKey("dmr_callsign")) {
    dmr_callsign = preferences.getString("dmr_callsign", DMR_CALLSIGN);
    dmr_id = preferences.getUInt("dmr_id", DMR_ID);
    dmr_server = preferences.getString("dmr_server", DMR_SERVER);
    dmr_password = preferences.getString("dmr_password", DMR_PASSWORD);
    dmr_essid = preferences.getUChar("dmr_essid", 0);

    // Load additional config options
    dmr_rx_freq = preferences.getUInt("dmr_rx_freq", 434000000);
    dmr_tx_freq = preferences.getUInt("dmr_tx_freq", 434000000);
    dmr_power = preferences.getUChar("dmr_power", 10);
    dmr_color_code = preferences.getUChar("dmr_cc", 1);
    dmr_latitude = preferences.getFloat("dmr_lat", 0.0);
    dmr_longitude = preferences.getFloat("dmr_lon", 0.0);
    dmr_height = preferences.getInt("dmr_height", 0);
    dmr_location = preferences.getString("dmr_location", "ESP32 Hotspot");
    dmr_description = preferences.getString("dmr_desc", "ESP32-MMDVM");
    dmr_url = preferences.getString("dmr_url", "");

    logSerial("[SYSTEM] Loaded DMR config from storage");
    logSerial("[SYSTEM] Callsign: " + dmr_callsign);
    logSerial("[SYSTEM] DMR ID: " + String(dmr_id));
    logSerial("[SYSTEM] Server: " + dmr_server);
    logSerial("[SYSTEM] ESSID: " + String(dmr_essid));
  }

  // Load WiFi alternate settings
  // Load alternate WiFi networks
  for (int i = 0; i < 5; i++) {
    String labelKey = "wifi" + String(i) + "_label";
    String ssidKey = "wifi" + String(i) + "_ssid";
    String passKey = "wifi" + String(i) + "_pass";
    wifiNetworks[i].label = preferences.getString(labelKey.c_str(), wifiNetworks[i].label);
    wifiNetworks[i].ssid = preferences.getString(ssidKey.c_str(), "");
    wifiNetworks[i].password = preferences.getString(passKey.c_str(), "");
  }

  // Load hostname setting
  device_hostname = preferences.getString("hostname", MDNS_HOSTNAME);
  logSerial("[SYSTEM] Hostname: " + device_hostname);

  // Load verbose logging setting
  verbose_logging = preferences.getBool("verbose_log", false);
  logSerial("[SYSTEM] Verbose logging: " + String(verbose_logging ? "enabled" : "disabled"));
  // Load debug settings (from preferences or config.h defaults)
  debug_serial = preferences.getBool("debug_serial", DEBUG_SERIAL);
  debug_mmdvm = preferences.getBool("debug_mmdvm", DEBUG_MMDVM);
  debug_network = preferences.getBool("debug_network", DEBUG_NETWORK);
  debug_dmr = preferences.getBool("debug_dmr", DEBUG_DMR);
  debug_password = preferences.getBool("debug_password", DEBUG_PASSWORD);
  logSerial("[SYSTEM] Debug settings - Serial: " + String(debug_serial ? "ON" : "OFF") + " | MMDVM: " + String(debug_mmdvm ? "ON" : "OFF") + " | Network: " + String(debug_network ? "ON" : "OFF") + " | DMR: " + String(debug_dmr ? "ON" : "OFF") + " | Password: " + String(debug_password ? "ON" : "OFF"));

  // Load OLED display setting
  enable_oled = preferences.getBool("enable_oled", ENABLE_OLED);
  logSerial("[OLED] OLED display: " + String(enable_oled ? "enabled" : "disabled"));

  // Load OLED auto-blanking settings (using shortened key names due to 15-char NVS limit)
  bool firstBootAutoBlank = !preferences.isKey("oled_autoblank");
  bool firstBootTimeout = !preferences.isKey("oled_blank_to");

  oledAutoBlankEnabled = preferences.getBool("oled_autoblank", OLED_AUTO_BLANK_ENABLE);
  oledBlankTimeout = preferences.getULong("oled_blank_to", OLED_BLANK_TIMEOUT);

  // Save defaults on first boot so they appear in showPrefs
  if (firstBootAutoBlank) {
    preferences.putBool("oled_autoblank", oledAutoBlankEnabled);
    logSerial("[OLED] Auto-blank setting initialized to default: " + String(oledAutoBlankEnabled ? "enabled" : "disabled"));
  }
  if (firstBootTimeout) {
    preferences.putULong("oled_blank_to", oledBlankTimeout);
    logSerial("[OLED] Blank timeout initialized to default: " + String(oledBlankTimeout / 1000) + "s");
  }

  logSerial("[OLED] Auto-blank: " + String(oledAutoBlankEnabled ? "enabled" : "disabled") + ", Timeout: " + String(oledBlankTimeout / 1000) + "s");

  // Load NTP timezone settings
  ntp_timezone_offset = preferences.getLong("ntp_tz_offset", NTP_TIMEZONE_OFFSET);
  ntp_daylight_offset = preferences.getLong("ntp_dst_offset", NTP_DAYLIGHT_OFFSET);
  logSerial("[NTP] Timezone offset: " + String(ntp_timezone_offset) + "s, DST offset: " + String(ntp_daylight_offset) + "s");

