javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  // Load web username
  web_username = preferences.getString("web_username", WEB_USERNAME);
  if (web_username.length() == 0) {
    web_username = WEB_USERNAME;  // Fallback to default if empty
  }

  // Load web password
  web_password = preferences.getString("web_password", WEB_PASSWORD);
  if (web_password.length() == 0) {
    web_password = WEB_PASSWORD;  // Fallback to default if empty
  }
  logSerial("[SYSTEM] Web authentication: enabled (user/password: " + web_username + "/" + web_password + ")");

  // Load mode enable/disable settings (use config.h defaults if not saved)
  mode_dmr_enabled = preferences.getBool("mode_dmr", DEFAULT_MODE_DMR);
  mode_dstar_enabled = preferences.getBool("mode_dstar", DEFAULT_MODE_DSTAR);
  mode_ysf_enabled = preferences.getBool("mode_ysf", DEFAULT_MODE_YSF);
  mode_p25_enabled = preferences.getBool("mode_p25", DEFAULT_MODE_P25);
  mode_nxdn_enabled = preferences.getBool("mode_nxdn", DEFAULT_MODE_NXDN);
  mode_pocsag_enabled = preferences.getBool("mode_pocsag", DEFAULT_MODE_POCSAG);
  logSerial("[SYSTEM] Mode status - DMR: " + String(mode_dmr_enabled ? "ON" : "OFF") + " | D-Star: " + String(mode_dstar_enabled ? "ON" : "OFF") + " | YSF: " + String(mode_ysf_enabled ? "ON" : "OFF") + " | P25: " + String(mode_p25_enabled ? "ON" : "OFF") + " | NXDN: " + String(mode_nxdn_enabled ? "ON" : "OFF") + " | POCSAG: " + String(mode_pocsag_enabled ? "ON" : "OFF"));

  // Load modem type
  modem_type = preferences.getString("modem_type", DEFAULT_MODEM_TYPE);
  logSerial("[MODEM] Modem type: " + modem_type);

  // Load MQTT settings
  mqtt_enabled = preferences.getBool("mqtt_enabled", MQTT_ENABLED);
  mqtt_broker = preferences.getString("mqtt_broker", MQTT_BROKER);
  mqtt_port = preferences.getUShort("mqtt_port", MQTT_PORT);
  mqtt_username = preferences.getString("mqtt_user", MQTT_USERNAME);
  mqtt_password = preferences.getString("mqtt_pass", MQTT_PASSWORD);

  // Use callsign as default client ID if not configured
  String defaultClientId = String(MQTT_CLIENT_ID);
  if (defaultClientId.length() == 0) defaultClientId = dmr_callsign;
  mqtt_client_id = preferences.getString("mqtt_client", defaultClientId);

  // Use {hostname}/{callsign} as default topic prefix if not configured
  String defaultPrefix = String(MQTT_TOPIC_PREFIX);
  if (defaultPrefix.length() == 0) defaultPrefix = device_hostname + "/" + dmr_callsign;
  mqtt_topic_prefix = preferences.getString("mqtt_prefix", defaultPrefix);

  mqtt_publish_interval = preferences.getUInt("mqtt_interval", MQTT_PUBLISH_INTERVAL);

  if (mqtt_enabled) {
    logSerial("[MQTT] MQTT enabled - Broker: " + mqtt_broker + ":" + String(mqtt_port));
    logSerial("[MQTT] Client ID: " + mqtt_client_id + " | Topic prefix: " + mqtt_topic_prefix);
  } else {
    logSerial("[MQTT] MQTT disabled");
  }

  preferences.end();
}

void saveConfig() {
  preferences.begin("mmdvm", false);

  preferences.putString("dmr_callsign", dmr_callsign);
  preferences.putUInt("dmr_id", dmr_id);
  preferences.putString("dmr_server", dmr_server);
  preferences.putString("dmr_password", dmr_password);
  preferences.putUChar("dmr_essid", dmr_essid);

  // Save additional config options
  preferences.putUInt("dmr_rx_freq", dmr_rx_freq);
  preferences.putUInt("dmr_tx_freq", dmr_tx_freq);
  preferences.putUChar("dmr_power", dmr_power);
  preferences.putUChar("dmr_cc", dmr_color_code);
  preferences.putFloat("dmr_lat", dmr_latitude);
  preferences.putFloat("dmr_lon", dmr_longitude);
  preferences.putInt("dmr_height", dmr_height);
  preferences.putString("dmr_location", dmr_location);
  preferences.putString("dmr_desc", dmr_description);
  preferences.putString("dmr_url", dmr_url);

  // Save alternate WiFi networks
  for (int i = 0; i < 5; i++) {
    String labelKey = "wifi" + String(i) + "_label";
    String ssidKey = "wifi" + String(i) + "_ssid";
    String passKey = "wifi" + String(i) + "_pass";
    preferences.putString(labelKey.c_str(), wifiNetworks[i].label);
    preferences.putString(ssidKey.c_str(), wifiNetworks[i].ssid);
    preferences.putString(passKey.c_str(), wifiNetworks[i].password);
  }

  // Save hostname
  preferences.putString("hostname", device_hostname);

  // Save verbose logging
  preferences.putBool("verbose_log", verbose_logging);

  // Save debug settings
  preferences.putBool("debug_serial", debug_serial);
  preferences.putBool("debug_mmdvm", debug_mmdvm);
  preferences.putBool("debug_network", debug_network);
  preferences.putBool("debug_dmr", debug_dmr);
  preferences.putBool("debug_password", debug_password);

  // Save OLED display setting
  preferences.putBool("enable_oled", enable_oled);

  // Save OLED auto-blanking settings
  preferences.putBool("oled_autoblank", oledAutoBlankEnabled);
  preferences.putULong("oled_blank_to", oledBlankTimeout);

  // Save web credentials
  preferences.putString("web_username", web_username);
  preferences.putString("web_password", web_password);

  // Save mode enable/disable settings
  preferences.putBool("mode_dmr", mode_dmr_enabled);
  preferences.putBool("mode_dstar", mode_dstar_enabled);
  preferences.putBool("mode_ysf", mode_ysf_enabled);
  preferences.putBool("mode_p25", mode_p25_enabled);
  preferences.putBool("mode_nxdn", mode_nxdn_enabled);
  preferences.putBool("mode_pocsag", mode_pocsag_enabled);

  // Save modem type
  preferences.putString("modem_type", modem_type);

  // Save MQTT settings
  preferences.putBool("mqtt_enabled", mqtt_enabled);
  preferences.putString("mqtt_broker", mqtt_broker);
  preferences.putUShort("mqtt_port", mqtt_port);
  preferences.putString("mqtt_user", mqtt_username);
  preferences.putString("mqtt_pass", mqtt_password);
  preferences.putString("mqtt_client", mqtt_client_id);
  preferences.putString("mqtt_prefix", mqtt_topic_prefix);
  preferences.putUInt("mqtt_interval", mqtt_publish_interval);

  preferences.end();
  logSerial("[SYSTEM] Configuration saved to storage");
}

// ===== Web Server Setup =====
void setupWebServer() {
  // Main pages
  server.on("/", handleRoot);
  server.on("/status", handleStatus);
  server.on("/serialmonitor", handleMonitor);
  server.on("/wificonfig", handleConfig);
  server.on("/modeconfig", handleDMRConfig);
  server.on("/admin", handleAdmin);

