javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
  // Configuration handlers
  server.on("/saveconfig", HTTP_POST, handleSaveConfig);
  server.on("/savedmrconfig", HTTP_POST, handleSaveDMRConfig);
  server.on("/savemodes", HTTP_POST, handleSaveModes);
  server.on("/resetconfig", handleResetConfig);
  server.on("/confirmreset", HTTP_POST, handleConfirmReset);

  // API endpoints - JSON responses
  server.on("/api/logs", handleGetLogs);
  server.on("/api/status", handleStatusData);
  server.on("/api/wifiscan", handleWifiScan);
  server.on("/api/dmr-activity", handleDMRActivity);
  server.on("/api/dmr-slot1", handleDMRSlot1);
  server.on("/api/dmr-slot2", handleDMRSlot2);
  server.on("/api/dmr-history", handleDMRHistory);
  server.on("/api/rf-history", handleRFHistory);
  server.on("/api/system-status", handleSystemStatus);
  server.on("/api/system-information", handleSystemInformation);
  server.on("/api/modem-information", handleModemInformation);

  // Admin actions
  server.on("/clearlogs", HTTP_POST, handleClearLogs);
  server.on("/save-hostname", HTTP_POST, handleSaveHostname);
  server.on("/save-verbose", HTTP_POST, handleSaveVerbose);
  server.on("/save-debug", HTTP_POST, handleSaveDebug);
  server.on("/save-oled", HTTP_POST, handleSaveOLED);
  server.on("/save-timezone", HTTP_POST, handleSaveTimezone);
  server.on("/save-username", HTTP_POST, handleSaveUsername);
  server.on("/save-password", HTTP_POST, handleSavePassword);
  server.on("/save-mqtt-config", HTTP_POST, handleSaveMqttConfig);
  server.on("/api/mqtt-monitor", handleMqttMonitor);
  server.on("/reboot", HTTP_POST, handleReboot);
  server.on("/restart-services", HTTP_POST, handleRestartServices);
  server.on("/export-config", handleExportConfig);
  server.on(
    "/import-config", HTTP_POST, []() {}, handleImportConfig);
  server.on("/showprefs", handleShowPreferences);
  server.on("/test-mmdvm", HTTP_POST, handleTestMmdvm);
  server.on("/cleanup-prefs", HTTP_POST, handleCleanupPreferences);
  server.on("/download-update", HTTP_POST, handleDownloadUpdate);
  server.on(
    "/upload-firmware", HTTP_POST, []() {}, handleUploadFirmware);
  server.on("/flash-firmware", HTTP_POST, handleFlashFirmware);

  // MMDVM Modem firmware flasher endpoints
  server.on(
    "/flash-modem-upload", HTTP_POST, []() {}, handleFlashModemUpload);
  server.on("/flash-modem-url", HTTP_POST, handleFlashModemURL);
  server.on("/modem-flash-status", handleModemFlashStatus);

  server.begin();
  logSerial("[SYSTEM] Web server started.");
}

// ===== Status LED Control =====
void setLEDMode(LED_MODE mode) {
  currentLedMode = mode;
  lastLedToggle = millis();

  // Set initial state based on mode
  if (mode == LED_MODE::STEADY) {
    digitalWrite(STATUS_LED_PIN, HIGH);
    ledState = true;
  } else if (mode == LED_MODE::OFF) {
    digitalWrite(STATUS_LED_PIN, LOW);
    ledState = false;
  }
}

void updateStatusLED() {
  unsigned long currentMillis = millis();
  unsigned long interval;

  switch (currentLedMode) {
    case LED_MODE::OFF:
      // LED stays off
      break;

    case LED_MODE::STEADY:
      // LED stays on
      break;

    case LED_MODE::FAST_BLINK:
      // Fast blink (200ms interval) - connecting to WiFi
      interval = 200;
      if (currentMillis - lastLedToggle >= interval) {
        ledState = !ledState;
        digitalWrite(STATUS_LED_PIN, ledState ? HIGH : LOW);
        lastLedToggle = currentMillis;
      }
      break;

    case LED_MODE::SLOW_BLINK:
      // Slow blink (1000ms interval) - Access Point mode
      interval = 1000;
      if (currentMillis - lastLedToggle >= interval) {
        ledState = !ledState;
        digitalWrite(STATUS_LED_PIN, ledState ? HIGH : LOW);
        lastLedToggle = currentMillis;
      }
      break;
  }
}

// ===== DMR User Information Lookup Functions =====

// Enhanced user info lookup - checks cache first, then API
String lookupUserInfo(uint32_t dmrId) {
  if (dmrId == 0) return "";

  // Check for special DMR system IDs first (these won't be in RadioID database)
  switch (dmrId) {
    case 9990: return "Echo|Echo Test|Parrot|Service";
    case 4000: return "Disconnect|Disconnect|Service|Command";
    case 5000: return "Status|Status Check|Service|Command";
    case 8045: return "Time|Time Server|Service|Server";
    case 9000: return "NXDN|NXDN Reflector|Service|Server";
    case 9099: return "Info|Information|Service|Server";
    default: break;  // Continue with normal lookup
  }

  // Check cache first
  String cached = getCachedUserInfo(dmrId);
  if (cached.length() > 0) {
    return cached;
  }

  // Not in cache, try API lookup
  String userInfo = lookupUserInfoAPI(dmrId);

  // Cache the result (even if empty to avoid repeated failed lookups)
  if (userInfo.length() > 0) {
    cacheUserInfo(dmrId, userInfo);
  }

  return userInfo;
}

// Legacy callsign lookup function - checks cache first, then API
String lookupCallsign(uint32_t dmrId) {
  if (dmrId == 0) return "";

  // Try enhanced lookup first
  String userInfo = lookupUserInfo(dmrId);
  if (userInfo.length() > 0) {
    int pipeIndex = userInfo.indexOf('|');
    return (pipeIndex > 0) ? userInfo.substring(0, pipeIndex) : userInfo;
  }

  // Fallback to legacy cache
  String cached = getCachedCallsign(dmrId);
  if (cached.length() > 0) {
    return cached;
  }

  // Not in cache, try API lookup
  String callsign = lookupCallsignAPI(dmrId);

  // Cache the result (even if empty to avoid repeated failed lookups)
  if (callsign.length() > 0) {
    cacheCallsign(dmrId, callsign);
  }

  return callsign;
}

// Check if user info is in cache
String getCachedUserInfo(uint32_t dmrId) {
  for (int i = 0; i < DMR_USER_CACHE_SIZE; i++) {
    if (userCache[i].dmrId == dmrId && userCache[i].userInfo.length() > 0) {
      return userCache[i].userInfo;
    }
  }
  return "";
}

// Add user info to cache (circular buffer)
void cacheUserInfo(uint32_t dmrId, String userInfo) {
  userCache[userCacheIndex].dmrId = dmrId;
  userCache[userCacheIndex].userInfo = userInfo;
  userCache[userCacheIndex].timestamp = millis();
  userCacheIndex = (userCacheIndex + 1) % DMR_USER_CACHE_SIZE;
}

// Check if callsign is in legacy cache
String getCachedCallsign(uint32_t dmrId) {
  for (int i = 0; i < DMR_CALLSIGN_CACHE_SIZE; i++) {
    if (callsignCache[i].dmrId == dmrId && callsignCache[i].callsign.length() > 0) {
      return callsignCache[i].callsign;
    }
  }
  return "";
}

// Add callsign to legacy cache (circular buffer)
void cacheCallsign(uint32_t dmrId, String callsign) {
  callsignCache[callsignCacheIndex].dmrId = dmrId;
  callsignCache[callsignCacheIndex].callsign = callsign;
  callsignCache[callsignCacheIndex].timestamp = millis();
  callsignCacheIndex = (callsignCacheIndex + 1) % DMR_CALLSIGN_CACHE_SIZE;
}

// Enhanced user info lookup via RadioID.net API
String lookupUserInfoAPI(uint32_t dmrId) {
  if (!wifiConnected) {
    return "";
  }

  HTTPClient http;
  String url = String(DMR_API_URL) + String(dmrId);

  http.begin(url);
  http.setTimeout(DMR_API_TIMEOUT);  // API timeout from config.h

  int httpCode = http.GET();
  String userInfo = "";

  if (httpCode == 200) {
    String payload = http.getString();

    // RadioID.net returns JSON: {"count":1,"results":[{"id":2041152,"callsign":"PA3ANG","fname":"John","name":"John","city":"Amsterdam","country":"Netherlands",...}]}
    // Parse multiple fields: callsign, name/fname, city, country
    String callsign = "";
    String name = "";
    String city = "";
    String country = "";

