javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
    // Extract callsign
    int csIndex = payload.indexOf("\"callsign\":\"");
    if (csIndex > 0) {
      csIndex += 12;  // Length of "callsign":"
      int endIndex = payload.indexOf("\"", csIndex);
      if (endIndex > csIndex) {
        callsign = payload.substring(csIndex, endIndex);
      }
    }

    // Extract name (prefer 'name' over 'fname')
    int nameIndex = payload.indexOf("\"name\":\"");
    if (nameIndex > 0) {
      nameIndex += 8;  // Length of "name":"
      int endIndex = payload.indexOf("\"", nameIndex);
      if (endIndex > nameIndex) {
        name = payload.substring(nameIndex, endIndex);
        if (name == "null" || name.length() == 0) {
          // Try fname if name is null/empty
          int fnameIndex = payload.indexOf("\"fname\":\"");
          if (fnameIndex > 0) {
            fnameIndex += 9;  // Length of "fname":"
            int fendIndex = payload.indexOf("\"", fnameIndex);
            if (fendIndex > fnameIndex) {
              name = payload.substring(fnameIndex, fendIndex);
            }
          }
        }
      }
    }

    // Extract city
    int cityIndex = payload.indexOf("\"city\":\"");
    if (cityIndex > 0) {
      cityIndex += 8;  // Length of "city":"
      int endIndex = payload.indexOf("\"", cityIndex);
      if (endIndex > cityIndex) {
        city = payload.substring(cityIndex, endIndex);
        if (city == "null") city = "";
      }
    }

    // Extract country
    int countryIndex = payload.indexOf("\"country\":\"");
    if (countryIndex > 0) {
      countryIndex += 11;  // Length of "country":"
      int endIndex = payload.indexOf("\"", countryIndex);
      if (endIndex > countryIndex) {
        country = payload.substring(countryIndex, endIndex);
        if (country == "null") country = "";
      }
    }

    // Build userInfo string: "callsign|name|city|country"
    if (callsign.length() > 0) {
      userInfo = callsign;
      if (name.length() > 0 || city.length() > 0 || country.length() > 0) {
        userInfo += "|" + name + "|" + city + "|" + country;
      }
    }
  } else if (httpCode > 0) {
    logSerial("[API] User info lookup failed: HTTP " + String(httpCode));
  }

  http.end();
  return userInfo;
}

// Legacy callsign lookup via RadioID.net API
String lookupCallsignAPI(uint32_t dmrId) {
  // Use enhanced lookup and extract just the callsign
  String userInfo = lookupUserInfoAPI(dmrId);
  if (userInfo.length() > 0) {
    int pipeIndex = userInfo.indexOf('|');
    return (pipeIndex > 0) ? userInfo.substring(0, pipeIndex) : userInfo;
  }
  return "";
}

// Helper function to get current timestamp in HH:MM:SS format
String getCurrentTimestamp() {
  struct tm timeinfo;
  if (getLocalTime(&timeinfo)) {
    // We have NTP time
    char timeStr[9];
    strftime(timeStr, sizeof(timeStr), "%H:%M:%S", &timeinfo);
    return String(timeStr);
  } else {
    // Fallback to uptime if NTP not available
    unsigned long totalSeconds = millis() / 1000;
    int hours = (totalSeconds / 3600) % 24;
    int minutes = (totalSeconds / 60) % 60;
    int seconds = totalSeconds % 60;

    String timestamp = "";
    if (hours < 10) timestamp += "0";
    timestamp += String(hours) + ":";
    if (minutes < 10) timestamp += "0";
    timestamp += String(minutes) + ":";
    if (seconds < 10) timestamp += "0";
    timestamp += String(seconds);
    return timestamp;
  }
}

// Add DMR transmission to history
void addDMRHistory(uint32_t srcId, String srcCallsign, String srcName, String srcLocation, uint32_t dstId, bool isGroup, uint32_t duration, uint8_t ber, uint8_t rssi, uint8_t slotNo) {
  // Debug log
  logSerial("[HISTORY] Adding to history: " + srcCallsign + " (" + String(srcId) + ") -> " + (isGroup ? "TG" : "") + String(dstId) + " Duration: " + String(duration) + "s");

  // Get current timestamp (NTP time or fallback to uptime)
  String timestamp = getCurrentTimestamp();

  // Add to circular buffer
  dmrHistory[dmrHistoryIndex].timestamp = timestamp;
  dmrHistory[dmrHistoryIndex].srcId = srcId;
  dmrHistory[dmrHistoryIndex].srcCallsign = srcCallsign;
  dmrHistory[dmrHistoryIndex].srcName = srcName;
  dmrHistory[dmrHistoryIndex].srcLocation = srcLocation;
  dmrHistory[dmrHistoryIndex].dstId = dstId;
  dmrHistory[dmrHistoryIndex].isGroup = isGroup;
  dmrHistory[dmrHistoryIndex].duration = duration;
  dmrHistory[dmrHistoryIndex].ber = ber;
  dmrHistory[dmrHistoryIndex].rssi = rssi;
  dmrHistory[dmrHistoryIndex].slotNo = slotNo;

  dmrHistoryIndex = (dmrHistoryIndex + 1) % DMR_HISTORY_SIZE;
}

// Add Local RF transmission to history (outgoing to network)
void addRFHistory(uint32_t srcId, String srcCallsign, uint32_t dstId, bool isGroup, uint32_t duration, uint8_t slotNo) {
  // Debug log
  logSerial("[RF HISTORY] Adding RF TX: " + srcCallsign + " (" + String(srcId) + ") -> " + (isGroup ? "TG" : "") + String(dstId) + " Duration: " + String(duration) + "s Slot: " + String(slotNo));

  // Get current timestamp (NTP time or fallback to uptime)
  String timestamp = getCurrentTimestamp();

  // Add to circular buffer
  rfHistory[rfHistoryIndex].srcId = srcId;
  rfHistory[rfHistoryIndex].srcCallsign = srcCallsign;
  rfHistory[rfHistoryIndex].dstId = dstId;
  rfHistory[rfHistoryIndex].isGroup = isGroup;
  rfHistory[rfHistoryIndex].duration = duration;
  rfHistory[rfHistoryIndex].slotNo = slotNo;
  rfHistory[rfHistoryIndex].timestamp = millis();

  rfHistoryIndex = (rfHistoryIndex + 1) % RF_HISTORY_SIZE;
}

#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
// Helper functions for Ethernet/SD status display
String getEthIPAddress() {
  return eth_connected ? ETH.localIP().toString() : "0.0.0.0";
}

String getEthMACAddress() {
  return eth_connected ? ETH.macAddress() : "00:00:00:00:00:00";
}

int getEthLinkSpeed() {
  return eth_connected ? ETH.linkSpeed() : 0;
}

bool getEthFullDuplex() {
  return eth_connected ? ETH.fullDuplex() : false;
}

String getEthGatewayIP() {
  return eth_connected ? ETH.gatewayIP().toString() : "0.0.0.0";
}

uint64_t getSDCardSize() {
  return sdCardAvailable ? SD.cardSize() : 0;
}

