javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
uint64_t getSDUsedBytes() {
  return sdCardAvailable ? SD.usedBytes() : 0;
}

uint8_t getSDCardType() {
  return sdCardAvailable ? sdCardType : 0;  // Return cached value
}
#endif

// ===== OLED Display Functions =====
#if ENABLE_OLED
void setupOLED() {
  if (!enable_oled) return;

  // Create mutex for display access protection
  displayMutex = xSemaphoreCreateMutex();
  if (displayMutex == NULL) {
    logSerial("[OLED] Failed to create display mutex!");
  } else {
    logSerial("[OLED] Display mutex created");
  }

  // Initialize I2C
  Wire.begin(I2C_SDA_PIN, I2C_SCL_PIN);

  // Initialize OLED display
  if (!display.begin(SSD1306_SWITCHCAPVCC, OLED_I2C_ADDRESS)) {
    logSerial("[OLED] SSD1306 allocation failed!");
    return;
  }
  logSerial("[OLED] Display initialized successfully");

  // Display boot logos
  //
  //Bitmap logo first
  displayBitmap();
  logSerial("[OLED] Display logo bitmap");
  delay(5000);  // Show logo for 2 seconds
  //
  // Then ESP32 logo
  //displayESP32Logo();
  //logSerial("[OLED] Showing ESP32 logo");
  //delay(2000);  // Show logo for 2 seconds
  //
  // boot logo last
  displayBootLogo();
  logSerial("[OLED] Showing boot screen");
}


void displayBitmap(void) {
  display.clearDisplay();

  display.drawBitmap(
    (display.width() - LOGO_WIDTH) / 2,
    (display.height() - LOGO_HEIGHT) / 2,
    logo_bmp, LOGO_WIDTH, LOGO_HEIGHT, 1);
  display.display();
  delay(1000);
}

void displayESP32Logo() {
  display.clearDisplay();

  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);

  // Draw decorative top border
  for (int i = 0; i < OLED_WIDTH; i += 4) {
    display.drawPixel(i, 0, SSD1306_WHITE);
    display.drawPixel(i + 1, 1, SSD1306_WHITE);
  }

  // ESP32 text - large and centered
  display.setTextSize(3);
  String esp32Text = "ESP32";
  int16_t x1, y1;
  uint16_t w, h;
  display.getTextBounds(esp32Text, 0, 0, &x1, &y1, &w, &h);
  int16_t x = (OLED_WIDTH - w) / 2;
  display.setCursor(x, 15);
  display.println(esp32Text);

  // MMDVM Hotspot text - smaller, centered
  display.setTextSize(1);
  String mmdvmText = "MMDVM Hotspot";
  display.getTextBounds(mmdvmText, 0, 0, &x1, &y1, &w, &h);
  x = (OLED_WIDTH - w) / 2;
  display.setCursor(x, 45);
  display.println(mmdvmText);

  // Draw decorative bottom border
  for (int i = 0; i < OLED_WIDTH; i += 4) {
    display.drawPixel(i, OLED_HEIGHT - 2, SSD1306_WHITE);
    display.drawPixel(i + 1, OLED_HEIGHT - 1, SSD1306_WHITE);
  }

  display.display();
}

void displayBootLogo() {
  display.clearDisplay();

  // Set text properties
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);

  // Title with callsign - centered
  String title = "ESP32 Hotspot";
  int16_t x1, y1;
  uint16_t w, h;
  display.getTextBounds(title, 0, 0, &x1, &y1, &w, &h);
  int16_t x = (OLED_WIDTH - w) / 2;
  display.setCursor(x, 0);
  display.println(title);

  // Draw a line
  display.drawLine(0, 10, OLED_WIDTH, 10, SSD1306_WHITE);

  // Firmware version
  display.setCursor(0, 14);
  display.println("Version:");
  display.setCursor(0, 24);
  display.println(FIRMWARE_VERSION);

  // Authors
  display.setCursor(0, 34);
  display.println("Made by:");
  display.setCursor(0, 44);
  display.println("PD2EMC & PD8JO");

  // Status
  display.setCursor(0, 55);
  display.println("Booting...");

  display.display();

  logSerial("[OLED] Boot logo displayed");
}

void updateBootStatus(String status) {
  if (!enable_oled) return;

  // Update only the status line at the bottom of boot screen
  // Clear the status area (bottom line)
  display.fillRect(0, 55, OLED_WIDTH, 9, SSD1306_BLACK);

  // Display new status
  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);
  display.setCursor(0, 55);
  display.println(status);

  display.display();

  logSerial("[OLED] " + status);
}

void updateOLEDStatus() {
  if (!enable_oled) return;

  // Try to acquire mutex to prevent SPI conflicts with Ethernet
  if (displayMutex != NULL) {
    if (xSemaphoreTake(displayMutex, pdMS_TO_TICKS(50)) != pdTRUE) {
      // Could not acquire mutex in 50ms, skip this update to avoid blocking
      logSerial("[OLED] Skipped update - mutex busy");
      return;
    }
  }

  // Clear entire display for clean look
  display.clearDisplay();

  display.setTextSize(1);
  display.setTextColor(SSD1306_WHITE);

  // ===== TOP LINE: Date on left, Time centered, Icons on right =====
  // Get current time
  struct tm timeinfo;
  String dateStr = "";
  String timeStr = "";
  if (getLocalTime(&timeinfo)) {
    char dateBuf[8];
    char timeBuf[8];
    strftime(dateBuf, sizeof(dateBuf), "%d/%m", &timeinfo);
    strftime(timeBuf, sizeof(timeBuf), "%H:%M", &timeinfo);
    dateStr = String(dateBuf);
    timeStr = String(timeBuf);
  } else {
    dateStr = "--/--";
    timeStr = "--:--";
  }

  // Display date on the left
  display.setCursor(0, 0);
  display.print(dateStr);

  // Display time centered
  int16_t x1, y1;
  uint16_t w, h;
  display.getTextBounds(timeStr, 0, 0, &x1, &y1, &w, &h);
  int16_t timeX = (OLED_WIDTH - w) / 2;
  display.setCursor(timeX, 0);
  display.print(timeStr);

  // Draw icons on the right side of top line (right to left)
  int iconX = OLED_WIDTH - ICON_WIDTH;  // Start from right edge

  // Draw network icons - show both if both connected
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
  if (eth_connected && wifiConnected) {
    // Both connected - show both icons
    display.drawBitmap(iconX, 0, icon_ethernet, ICON_WIDTH, ICON_HEIGHT, SSD1306_WHITE);
    iconX -= (ICON_WIDTH + 2);
    display.drawBitmap(iconX, 0, icon_wifi, ICON_WIDTH, ICON_HEIGHT, SSD1306_WHITE);
    iconX -= (ICON_WIDTH + 2);
  } else if (eth_connected) {
    // Ethernet only
    display.drawBitmap(iconX, 0, icon_ethernet, ICON_WIDTH, ICON_HEIGHT, SSD1306_WHITE);
    iconX -= (ICON_WIDTH + 2);
  } else if (wifiConnected) {
    // WiFi only
    display.drawBitmap(iconX, 0, icon_wifi, ICON_WIDTH, ICON_HEIGHT, SSD1306_WHITE);
    iconX -= (ICON_WIDTH + 2);
  }
#else
  if (wifiConnected) {
    display.drawBitmap(iconX, 0, icon_wifi, ICON_WIDTH, ICON_HEIGHT, SSD1306_WHITE);
    iconX -= (ICON_WIDTH + 2);
  }
#endif

  // Draw antenna/DMR icon (left of network icons)
  if (mode_dmr_enabled && dmrLoggedIn) {
    display.drawBitmap(iconX, 0, icon_antenna, ICON_WIDTH, ICON_HEIGHT, SSD1306_WHITE);
  }

  // Draw a line below top row
  display.drawLine(0, 10, OLED_WIDTH, 10, SSD1306_WHITE);

  // DMR Activity Section (between the two lines)
  // Check for active DMR transmission
  bool activityDisplayed = false;

  // Check if both slots are active
  bool bothSlotsActive = dmrActivity[0].active && dmrActivity[1].active;

  // Determine which slot to display
  int slotToDisplay = -1;
  if (bothSlotsActive) {
    // Both active - alternate between them
    slotToDisplay = oledActiveSlot;
    oledActiveSlot = (oledActiveSlot == 0) ? 1 : 0;  // Toggle for next update
  } else if (dmrActivity[1].active) {
    // Only Slot 2 active (prioritize Slot 2)
    slotToDisplay = 1;
  } else if (dmrActivity[0].active) {
    // Only Slot 1 active
    slotToDisplay = 0;
  }

  // Display the selected slot
  if (slotToDisplay >= 0) {
    int i = slotToDisplay;

    // Callsign - LARGE and prominent (2x size, centered)
    display.setTextSize(2);
    String callsign = (dmrActivity[i].srcCallsign.length() > 0) ? dmrActivity[i].srcCallsign : "Unknown";
    int16_t x1, y1;
    uint16_t w, h;
    display.getTextBounds(callsign, 0, 0, &x1, &y1, &w, &h);
    int16_t x = (OLED_WIDTH - w) / 2;
    display.setCursor(x, 14);
    display.println(callsign);

