javastraat/esp32_mmdvm_hotspot/esp32_mmdvm_hotspot.ino
    // Duration (small text, below callsign)
    display.setTextSize(1);
    display.setCursor(0, 32);
    unsigned long duration = (millis() - dmrActivity[i].startTime) / 1000;
    display.print("Duration: ");
    display.print(duration);
    display.println("s");

    // DMR ID -> Talkgroup with slot indicator at the end (small text)
    display.setCursor(0, 42);
    display.print(dmrActivity[i].srcId);
    display.print(" -> TG ");
    display.print(dmrActivity[i].dstId);
    display.print(" [S");
    display.print(dmrActivity[i].slotNo);
    display.print("]");

    activityDisplayed = true;
  }

  // If no active transmission, show idle state
  if (!activityDisplayed) {
    display.setCursor(0, 20);

    // Check if any mode is enabled
    bool anyModeEnabled = mode_dmr_enabled || mode_dstar_enabled || mode_ysf_enabled || mode_p25_enabled || mode_nxdn_enabled || mode_pocsag_enabled;

    if (!anyModeEnabled) {
      // No modes activated - center the text
      String line1 = "No mode activated";
      String line2 = "Enable mode in web";

      int16_t x1, y1;
      uint16_t w, h;

      // Center first line
      display.getTextBounds(line1, 0, 0, &x1, &y1, &w, &h);
      int16_t x = (OLED_WIDTH - w) / 2;
      display.setCursor(x, 20);
      display.println(line1);

      // Center second line
      display.getTextBounds(line2, 0, 0, &x1, &y1, &w, &h);
      x = (OLED_WIDTH - w) / 2;
      display.setCursor(x, 30);
      display.println(line2);
    } else if (mode_dmr_enabled) {
      // DMR mode is enabled - show status
      if (dmrLoggedIn) {
        display.println("DMR: Listening");

        // Show current talkgroup if available
        if (currentTalkgroup > 0) {
          display.setCursor(0, 30);
          display.print("TG: ");
          display.println(currentTalkgroup);
        }

        // Show last caller callsign (check both slots for most recent)
        String lastCaller = "";
        unsigned long mostRecentTime = 0;

        for (int i = 0; i < 2; i++) {
          if (dmrActivity[i].srcCallsign.length() > 0 && dmrActivity[i].lastUpdate > mostRecentTime) {
            lastCaller = dmrActivity[i].srcCallsign;
            mostRecentTime = dmrActivity[i].lastUpdate;
          }
        }

        if (lastCaller.length() > 0) {
          display.setCursor(0, 40);
          display.print("Last: ");
          display.println(lastCaller);
        }
      } else {
        // DMR enabled but not connected
        display.println("DMR Mode Active");
        display.setCursor(0, 30);
        display.print("Status: ");
        display.println(dmrLoginStatus);
      }
    } else {
      // Other mode is enabled (D-Star, YSF, P25, NXDN, POCSAG)
      // Show which mode(s) are enabled but not yet implemented
      display.println("Mode enabled:");
      display.setCursor(0, 30);
      if (mode_dstar_enabled) display.println("D-Star (N/A)");
      else if (mode_ysf_enabled) display.println("YSF (N/A)");
      else if (mode_p25_enabled) display.println("P25 (N/A)");
      else if (mode_nxdn_enabled) display.println("NXDN (N/A)");
      else if (mode_pocsag_enabled) display.println("POCSAG (N/A)");
    }
  }

  // ===== BOTTOM ROW: Cycling Network/Callsign info =====
  // Draw a line above bottom status
  display.drawLine(0, 50, OLED_WIDTH, 50, SSD1306_WHITE);

  display.setTextSize(1);

  // Determine what to show based on connections and cycle state
  bool hasWifi = wifiConnected;
  bool hasEth = false;
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
  hasEth = eth_connected;
#endif

  String bottomLine = "";
  bool centerText = false;  // Flag to center callsign text

  if (hasWifi && hasEth) {
    // Both connected - cycle through 3 screens
    if (oledHeaderCycle == 0) {
      bottomLine = "WiFi: " + WiFi.localIP().toString();
    } else if (oledHeaderCycle == 1) {
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
      bottomLine = "ETH: " + ETH.localIP().toString();
#endif
    } else {
      bottomLine = dmr_callsign + " - ESP32 HS";
      centerText = true;
    }
  } else if (hasWifi) {
    // WiFi only - alternate between 2 screens
    if (oledHeaderCycle % 2 == 0) {
      bottomLine = "WiFi: " + WiFi.localIP().toString();
    } else {
      bottomLine = dmr_callsign + " - ESP32 HS";
      centerText = true;
    }
  } else if (hasEth) {
    // ETH only - alternate between 2 screens
    if (oledHeaderCycle % 2 == 0) {
#ifdef LILYGO_T_ETH_ELITE_ESP32S3_MMDVM
      bottomLine = "ETH: " + ETH.localIP().toString();
#endif
    } else {
      bottomLine = dmr_callsign + " - ESP32 HS";
      centerText = true;
    }
  } else if (apMode) {
    // AP mode
    if (oledHeaderCycle % 2 == 0) {
      bottomLine = "AP: " + WiFi.softAPIP().toString();
    } else {
      bottomLine = dmr_callsign + " - ESP32 HS";
      centerText = true;
    }
  } else {
    // No network - alternate between warning and callsign
    if (oledHeaderCycle % 2 == 0) {
      bottomLine = "No Network";
      centerText = true;
    } else {
      bottomLine = dmr_callsign + " - ESP32 HS";
      centerText = true;
    }
  }

  // Center the text if it's the callsign, otherwise left-align
  if (centerText) {
    int16_t x1, y1;
    uint16_t w, h;
    display.getTextBounds(bottomLine, 0, 0, &x1, &y1, &w, &h);
    int16_t x = (OLED_WIDTH - w) / 2;
    display.setCursor(x, 54);
  } else {
    display.setCursor(0, 54);
  }

  display.print(bottomLine);

  display.display();

  // Release mutex after display update is complete
  if (displayMutex != NULL) {
    xSemaphoreGive(displayMutex);
  }
}

// Control OLED display power (software on/off)
void setOLEDPower(bool on) {
  if (!enable_oled) return;

  if (on) {
    display.ssd1306_command(SSD1306_DISPLAYON);
    oledDisplayOn = true;
    logSerial("[OLED] Display turned ON");
  } else {
    display.ssd1306_command(SSD1306_DISPLAYOFF);
    oledDisplayOn = false;
    logSerial("[OLED] Display turned OFF");
  }
}

// Toggle OLED display power
void toggleOLEDPower() {
  setOLEDPower(!oledDisplayOn);
}

#else
// Stub functions when OLED is disabled at compile time
void setupOLED() {
  // No-op when OLED is disabled
}

void updateBootStatus(String status) {
  // No-op when OLED is disabled
}

void updateOLEDStatus() {
  // No-op when OLED is disabled
}

void setOLEDPower(bool on) {
  // No-op when OLED is disabled
}

void toggleOLEDPower() {
  // No-op when OLED is disabled
}
#endif
